{
  "Lesson-1": {
    "theme": "TOEFL Vocabulary",
    "vocabulary": [
      {
        "word": "abandon[ə'bændən]",
        "chinese": "(v) : to leave; to give upEx: To saves their lives, the sailors had to abandon the shinking ship.Part of speech: abandonment (n)"
      },
      {
        "word": "adversely['ædvə:sli]",
        "chinese": "(adv) : In a harmful way; negativelyEx: Excessive rainfall early in the spring can adversely affect the planting of crops.His studies are adversely affected by his family situation.Her health was adversely affected by the climate. Usage tips Aversely is often followed by effect.Parts of Speech adversity (n), adverse (adj)"
      },
      {
        "word": "aggregate ['ægrigit]",
        "chinese": "(adj) Gathered into or amounting to a wholeIt is impossible to judge last year's performance without knowing the aggregate sales numbers.Usage tips Aggregate is often followed by a term like sum, total, or number.Part of speech aggregate (v) aggregate (n)"
      },
      {
        "word": "cultivation[,kʌlti'vei∫n]",
        "chinese": "(n) Preparing the land to grow crops; improvement for agricultural purposesWith the development of land cultivation, hunters and gatherers were able to settle in one place.Part of speech cultivate (v)"
      },
      {
        "word": "fertilize ['fə:tilaiz]",
        "chinese": "(v) to supply with nourishment for plants by adding helpful subtances to the soilThis farm fertilizes tomatoes more than any other crop.Part of speech fertilizer (n), fertilization (n)"
      },
      {
        "word": "intensify[in'tensifai]",
        "chinese": "(v) To increase in power; to act with increased strengthEx: Jacob's long absence intensified his certainty that he should marry RoseViolence intensified during the night. The opposition leader has intensified his attacks on the government. (~ sth)Part of speech intensification (n), intense (adj)"
      },
      {
        "word": "irrigation[,iri'gei∫n]",
        "chinese": "n. The supplying of water to dry land.Ex: In dry areas of the country, you can see ditches all over the farmland for irrigation.Parts of speech irrigate (v) ['irigeit]"
      },
      {
        "word": "obtain[əb'tein]",
        "chinese": "v. To gain possesion of; to getEx: After a series of difficult interviews, he finally was able to obtain the job."
      },
      {
        "word": "photosynthesis[,foutou'sinθəsis]",
        "chinese": "n. The process by which green plants make their own food by combining water, salts, and carbon dioxide in the presence of the light.Ex: Oxygen is a by-product of the process of photosynthesis.Parts of seech photosynthesize (v)"
      },
      {
        "word": "precipitation[pri,sipi'tei∫n]",
        "chinese": "n. Water that fall to the Earth's surfaceEx: In the Pacific Northwest, the high level of precipitation ensures rich, green plant life."
      },
      {
        "word": "anticipate [æn'tisipeit]",
        "chinese": "v. To expect; to sense something before it happensEx: By placing sensors in earthquake-prone areas, scientists can anticipate some tremors in time to warn the public.Parts of speech anticipation n, anticipatory adj"
      },
      {
        "word": "catastrophic [,kætə'strɔfik]",
        "chinese": "adj. Extremely harmful; causing financial or physical ruinEx: The architect died in a catastrophic elevator accident.Parts of speech catastrophe n [kə'tæstrəfi] catastrophically adv [,kætə'strɔfikəli]"
      },
      {
        "word": "collide [kə'laid]",
        "chinese": "v. To come together with great or violent forceEx: As usual, their holiday was ruined when their in-laws’ views on politics collided with their own.The car and the van collided head-on in thick fog. The car collided head-on with the van. (~ with sth/sb)As he fell, his head collided with the table. They regularly collide over policy decisions. Parts of speech collision n"
      },
      {
        "word": "eruption[ıə'rʌpʃən]",
        "chinese": "n. A sudden, often violent, outburstThe eruption of Mount St. Helens in 1980 caused 57 deaths and immeasurable change to the face of the mountain.Usage tips Eruption is often followed by an ofphrase.Parts of speech erupt v"
      },
      {
        "word": "famine['fæmin]",
        "chinese": "n. Severe hunger; a drastic food shortageThe potato famine in Ireland in the mid-nineteenth century caused large numbers of Irish people to emigrate to America."
      },
      {
        "word": "flood[flʌd]",
        "chinese": "n. An overflowing of water; an excessive amountThe constant rain and poor drainage system caused a flood in town.The political party sent out a flood of letters criticizing their opponents.Parts of speech flood v"
      },
      {
        "word": "impact ['impækt]",
        "chinese": "n. A strong influenceThe speech about the importance of education made an impact on me.Usage tips Impact is usually followed by on or of.Parts of speech impact v"
      },
      {
        "word": "persevere[,pə:si'viə(r)]",
        "chinese": "v. To keep going, despite obstacles or discouragement; tomaintain a purposeThe hikers persevered despite the bad weather and the icy trail.Parts of speech persist v, persistent adj"
      },
      {
        "word": "plunge[plʌndʒ]",
        "chinese": "v. To go down suddenly; to decrease by a great amount in ashort timeHe jumped off the diving board and plunged into the pool.The value of the company’s stock plunged after its chief executive was arrested.Usage tips Plunge is often followed by an into phrase.Parts of speech plunge n"
      },
      {
        "word": "unleash[ʌn'li:∫]",
        "chinese": "v. To release a thing or an emotionWhen they saw the strange man on their property, they unleashed their dogs.He is from such an unemotional family, he will never learn to unleash his feelings."
      },
      {
        "word": "adapt[ə'dæpt]",
        "chinese": "v. To adjust to the circumstances; to make suitableDinosaurs could not adapt to the warmer temperatures.The teacher adapted the exercises for his more advanced students.Usage tips Adapt is often followed by to.Parts of speech adaptation n, adapter n, adaptable adj"
      },
      {
        "word": "diverse[dai'və:s]",
        "chinese": "n. Various; showing a lot of differences within a groupIndia is one of the most linguistically diverse countries in the world.Usage tips An -ly adverb (e.g.,linguistically) often comes before diverse.Parts of speech diversify v, diversity n, diversification n"
      },
      {
        "word": "evolve[i'vɔlv]",
        "chinese": "v. To develop; to come forthModern-day sharks evolved from their ancestor Eryops, which livedmore than 200 million years ago.Usage tips Evolve is often followed by into or from.Parts of speech evolution n, evolutionist n"
      },
      {
        "word": "feature ['fi:t∫ə]",
        "chinese": "n. Part, characteristicThe best feature of this car is its heated seats.Usage tips Feature is often followed by of.Parts of speech feature v"
      },
      {
        "word": "generation[,dʒenə'rei∫n]",
        "chinese": "n. A group of people born at about the same timeAs older managers retired, a new generation of leaders took controlof the company.Usage tips Before generation, an adjective like new, next, earlier, orolder is common. Generation is often followed by of.Parts of speech generational adj"
      },
      {
        "word": "inherent[in'hiərənt]",
        "chinese": "adj. Naturally characteristic; always found within something,because it’s a basic part of that thingNo job can be interesting all the time. Boredom is inherent in anykind of work.Inherent attributes: Các thuộc tính cố hữuUsage tips Inherent is often followed by in.Parts of speech inherently adv"
      },
      {
        "word": "migration[mai'grei∫n]",
        "chinese": "n. Movement from one place to another by a group of people or animalsThe migration of farm workers from one state to the next dependsprimarily on the harvest.Usage tips Migration is often followed by to or from.Parts of speech migrate v, migrant n, migratory adj"
      },
      {
        "word": "physical['fizikl]",
        "chinese": "adj. Related to the body; related to materials that can be seen or feltBecause of the shape of its throat, an ape does not have the physical ability to speak.The mountains form a physical barrier between the west and the east.Usage tips Physical usually comes before the noun it describes.Parts of speech physically adv"
      },
      {
        "word": "process['prouses]",
        "chinese": "n. A series of steps leading to a resultTo get a good job, most people go through a long process of letterwriting and interviews.Usage tips Process is often followed by of plus the -ing form of a verb.Parts of speech proceed v, process v"
      },
      {
        "word": "survive[sə'vaiv]",
        "chinese": "v. To continue living (despite some danger or illness)After getting lost in the mountains, Gordon survived by eating wildplants and catching fish.Usage tips Survive is often followed by a phrase with by.Parts of speech survivor n, survival n"
      },
      {
        "word": "constraint[kən'streint]",
        "chinese": "n. Something that restricts thought or actionThe constraints of military life kept Eileen from seeing Private Morris more than once a month. Parts of speech constrain v"
      },
      {
        "word": "contamination[kən,tæmi'nei∫n]",
        "chinese": "n. Being made less clean by a germ or hazardous substanceThe contamination in the river came from the factory located justupstream.Parts of speech contaminate v,contaminant n"
      },
      {
        "word": "deplete[dıp'li:t]",
        "chinese": "v. To greatly decrease the supply of a resource or materialThe prolonged war depleted the country’s national treasury.Parts of speech depletion n [di'pli:∫n]"
      },
      {
        "word": "dispose of[dis'pouz]",
        "chinese": "v. To throw away; to get rid of; to killShe disposed of her unwanted possessions before moving.The tyrant cruelly disposed of all his enemies.Usage tips Dispose of should be learned as a unit. In this meaning,dispose does not occur without of.Parts of speech disposal n, disposable adj"
      },
      {
        "word": "elementally[,eli'mentli]",
        "chinese": "adv. In terms of elements; basicallyElementally, coal and diamonds are the same.Parts of speech element n, elemental adj"
      },
      {
        "word": "emission[i'mi∫n]",
        "chinese": "n. Sending out from a small space into the general environment; a substance discharged into the airThe Environmental Protection Agency regulates the emission ofpollutants into the air.Usage tips Emission is usually followed by an ofphrase.Parts of speech emit v"
      },
      {
        "word": "extinction[ık'stıŋkʃən]",
        "chinese": "n. Complete disappearance; the end of existenceHuman beings have caused the extinction of many other species.Usage tips Extinction implies an absolute end; an extinct thingcannot be brought back into existence.Parts of speech extinct adj"
      },
      {
        "word": "reservoir['rezəvwɑ:]",
        "chinese": "n. A place where a liquid is collected and storedCult members threatened to poison the town’s water reservoir.Parts of speech reserve v [ri'zə:v]"
      },
      {
        "word": "shrink[∫riηk]",
        "chinese": "v. To become reduced in size, amount, or valueIf you dry your clothing on the “high heat” setting, they may shrink.Parts of speech shrinkage n, shrinkable adj"
      },
      {
        "word": "stable ['steibl]",
        "chinese": "adj. Firm and dependable; showing little changeHe fell because the ladder wasn’t stable.Parts of speech stability n, stably adv"
      },
      {
        "word": "adjust[ə'dʒʌst]",
        "chinese": "v. To change; to get accustomed to somethingTravelers are advised to adjust their watches before arriving in the new time zone.Parts of speech adjustment n, adjustable adj"
      },
      {
        "word": "arbitrary ['ɑ:bitrəri]",
        "chinese": "adj. Chosen simply by whim or chance, not for any specificreasonThe decision to build a school in Blackberry Township was arbitrary, without any thought to future housing patterns.Parts of speech arbitrate v, arbitrator n, arbitrarily adv"
      },
      {
        "word": "denominator[di'nɔmineitə]",
        "chinese": "n. The number written below the line in a fractionIn the fraction 1⁄2, the number 2 is the denominator.Usage tips The phrase lowest common denominator means “the mostbasic and unsophisticated things that most people share.”Parts of speech denominate v,denomination n,denominational adj"
      },
      {
        "word": "exponentially[,ekspou'nen∫əli]",
        "chinese": "adv. At a very fast rateIn Turkey, the value of the lira has decreased exponentially in thelast several decades.Usage tips Exponentially is taken from mathematics, where an exponent is a number indicating how many times something ismultiplied by itself. For example, 4^3 contains the exponent “3,”indicating 4 ×4 ×4.Parts of speech exponent n, exponential adj"
      },
      {
        "word": "infinitesimal [,infini'tesiməl]",
        "chinese": "adj. Immeasurably smallThe number of contaminants in the water was infinitesimal, so thewater was safe to drink.infinitesimal geometry: hình học vi phâninfinitesimal transformation: biến đổi vi phânParts of speech infinitesimally adv"
      },
      {
        "word": "maximize['mæksimaiz]",
        "chinese": "v. To increase or make as great as possibleA coach helps each athlete maximize his or her potential.Parts of speech maximum n, maximum adj"
      },
      {
        "word": "parallel['pærəlel]",
        "chinese": "adj. Being an equal distance apart everywhereThe street where I live runs parallel to the main road through town.Usage tips Parallel is often followed by to.Parts of speech parallel n, parallel adv"
      },
      {
        "word": "proportion[prə'pɔ:∫n]",
        "chinese": "n. A part in relation to the wholeThe average employee spends a large proportion of each workdayanswering e-mails.Usage tips Proportion is often followed by of.Parts of speech proportionate adj, proportionally adv"
      },
      {
        "word": "rate[reit]",
        "chinese": "n. The cost per unit of a good or service; the motion or change thathappens in a certain time.Postal rates in Japan are among the highest in the world.Some grasses grow at the rate of one inch per day.Parts of speech rate v, rating n"
      },
      {
        "word": "sequence['si:kwəns]",
        "chinese": "v. To organize or arrange in successionVolunteers have been asked to sequence the files and organize theboxes.Parts of speech sequence n,sequentially adv"
      }
    ]
  },
  "Lesson-2": {
    "theme": "TOEFL Vocabulary",
    "vocabulary": [
      {
        "word": "accuracy['ækjurəsi]",
        "chinese": "n. Precision; exactnessThe research department checks all our articles for accuracy of facts before we print them.Usage tips Accuracy is often followed by of.Parts of speech accurate adj, accurately adv"
      },
      {
        "word": "adjacent[ə'dʒeisnt]",
        "chinese": "adj. Next toEven though the villages are adjacent to each other, their residentsspeak different languages.Usage tips Adjacent is often followed by to.Parts of speech adjacency n"
      },
      {
        "word": "compress[kəm'pres]",
        "chinese": "v. To press togetherTo make the foundation stronger, they compressed the soil beforepouring the concrete.Parts of speech compression n, compressed adj"
      },
      {
        "word": "feasibly['fi:zəbli]",
        "chinese": "adv. Practically; in a way that can workScientists can’t feasibly bring energy from deep ocean currents towhere it is needed on land.Parts of speech feasibility n, feasible adj ['fi:zəbl]"
      },
      {
        "word": "gut[gʌt]",
        "chinese": "v. To empty or hollow outIn order to remodel the house, we must first gut it and throw awayall the old fixtures.Usage tips Gut also means “the stomach of an animal”; this verbmakes an image, that the inside of a building is like the inside of ananimal.Parts of speech gut n, gutted adj"
      },
      {
        "word": "integrally['intigrəli]",
        "chinese": "adv. In a whole or complete mannerWriting and spelling are taught integrally as part of the reading program.Parts of speech integrate v, integrity n, integral n, integral adj"
      },
      {
        "word": "overlap['ouvəlæp]",
        "chinese": "v. To lie over part of something; to have elements in commonOne of the two assistants will likely get fired, since most of their duties in the office overlap.Parts of speech overlap n"
      },
      {
        "word": "retain[ri'tein]",
        "chinese": "v. To keep or holdThe rain fell so heavily that the banks of the river could not retainall the water.Parts of speech retainer n, retention n"
      },
      {
        "word": "seep[si:p]",
        "chinese": "v. To pass slowly for a long time, as a liquid or gas mightAs the containers rusted, the toxic waste seeped into the ground.water seeping through the roof of the tunnelUsage tips Seep is often followed by into or through."
      },
      {
        "word": "structure['strʌkt∫ə]",
        "chinese": "n. Something constructed, such as a buildingMost companies have a social structure that can’t be understood byoutsiders.Parts of speech structure v, structural adj, structurally adv"
      },
      {
        "word": "circulate['sə:kjuleit]",
        "chinese": "v. To move throughout an area or group; to move along asomewhat circular routeThe gossip circulated quickly through the small town.Blood circulates more quickly during physical exercise.Usage tips Circulate is often followed by through.Parts of speech circulation n"
      },
      {
        "word": "corrode[kə'roud]",
        "chinese": "v. To be slowly weakened by chemical reactionsSitting in salt water, the old coins corroded and became very easy tobreak.Usage tips A familiar kind of corrosion produces rust, the reddishcoating on iron or steel that has been exposed to air and water.Parts of speech corrosion n"
      },
      {
        "word": "derive[di'raiv]",
        "chinese": "v. To come from, usually through a long, slow processThe Cyrillic alphabet was derived from the Greek alphabet.Children derive great pleasure from sport.The new drug is derived from fish oil. He derived great pleasure from painting. Usage tips Derive is often followed by from.Parts of speech derivation n [,deri'vei∫n] , derivative adj [di'rivətiv]"
      },
      {
        "word": "detection[di'tek∫n]",
        "chinese": "n. Discovering something that cannot easily be foundWith new medical technology, the detection of cancer is much easiernowadays.Usage tips Detection is often followed by an ofphrase.Parts of speech detect v, detectable adj"
      },
      {
        "word": "expeditiously [,ekspi'di∫əsli]",
        "chinese": "adv. Quickly and efficientlyUsing carrier pigeons, the military commanders exchanged messages expeditiously.Parts of speech expedite v,expedition n, expeditious adj [,ekspi'di∫əs]"
      },
      {
        "word": "implement ['implimənt]",
        "chinese": "v. To make use of; to carry outNot until after the new software was installed could we implementthe new filing system.Parts of speech implement n,implementation n"
      },
      {
        "word": "innovative['inouveitiv]",
        "chinese": "adj. Ahead of the times; novelThe innovative use of props and lighting drew many favorable comments.Parts of speech innovation n"
      },
      {
        "word": "installation [,instə'lei∫n]",
        "chinese": "n. Setting something into position for useInstallation of the new software takes only four minutes.Parts of speech install v [in'stɔ:l]"
      },
      {
        "word": "maintenance['meintinəns]",
        "chinese": "n. The act of keeping something in good conditionThe only problem with living in such a big house is that it requiresa lot of maintenance.Parts of speech maintain v"
      },
      {
        "word": "simulation['sımjə'leıʃən]",
        "chinese": "n. An imitation or representationTo test car safety, automobile makers study crash simulations.Parts of speech simulate v, simulator n"
      },
      {
        "word": "combustion[kəm'bʌst∫n]",
        "chinese": "n. The process of burningWhen air quality is poor, combustion of materials in a fireplace isprohibited.Usage tips Combustion is often followed by of.Parts of speech combust v, combustible adj"
      },
      {
        "word": "component[kəm'pəunənt]",
        "chinese": "n. One part of a system or wholeTheir home theater system has a number of separate components.Usage tips Component is often followed or preceded by of."
      },
      {
        "word": "convey [kən'vei]",
        "chinese": "v. To transport from one place to another; to transmit or make knownA messenger conveyed the prince’s letter to the commander of thearmy.The worst part about being a doctor was when she had to conveybad news to a family.convey my good wishes to your parentsParts of speech conveyance n, conveyor n"
      },
      {
        "word": "discretely[dis'kri:tli]",
        "chinese": "adv. Separately; distinctly In order to understand how the engine worked, each componentneeded to be studied discretely.Parts of speech discrete adj [dis'kri:t]"
      },
      {
        "word": "nucleus['nju:kliəs]",
        "chinese": "n. A central or essential part around which other parts aregathered; a coreThe nucleus of many European cities is the town square.These painting will form the nucleus of the collection.Usage tips Nucleus is often followed by of.Parts of speech nuclear adj"
      },
      {
        "word": "permeate['pə:mieit]",
        "chinese": "v. To spread or flow throughout; to pass through or penetrateThe smell of cooking permeated the entire apartment building.Parts of speech permeation n [,pə:mi'ei∫n]"
      },
      {
        "word": "rotate/rou'teit/",
        "chinese": "v. To turn around; to take turns in sequenceThe planet rotates on its axis once every 14 Earth days.The children rotate classroom responsibilities on a weekly basis.Parts of speech rotation n"
      },
      {
        "word": "solar /'soulə/",
        "chinese": "adj. Of, or relating to, the sunThe ancient society kept time with a solar calendar."
      },
      {
        "word": "source /sɔ:s/",
        "chinese": "n. The point of origin or creationThe reporter was unable to identify the source of the informationfor his story.Parts of speech source v"
      },
      {
        "word": "trigger/'trigə/",
        "chinese": "v. To set off or initiateI was certain any mention of politics would trigger a big argument.The smoke triggered off the alarmParts of speech trigger n"
      },
      {
        "word": "acquisition[,ækwi'zi∫n]",
        "chinese": "n. The act of taking possession of somethingOur recent acquisition of over 2,000 books makes ours the biggestlibrary in the region.Usage tips Acquisition is often followed by of.Parts of speech acquire v"
      },
      {
        "word": "anomaly[ə'nɔməli]",
        "chinese": "n. Something unusualWhite tigers get their beautiful coloring from a genetic anomaly."
      },
      {
        "word": "consciously['kɔn∫əsli]",
        "chinese": "adv. With awareness of one’s actionsHe may have hurt her feelings, but he never would have done soconsciously.Parts of speech consciousness n, conscious adj"
      },
      {
        "word": "degrade[di'greid]",
        "chinese": "v. To reduce in value or strengthThe roads in cold or wet areas of the United States degrade fasterthan those in warm, sunny regions.Parts of speech degradation n [,degrə'dei∫n] degradable adj [dɪɡreɪdəbl]"
      },
      {
        "word": "gap [gæp]",
        "chinese": "n. Opening; a big difference in amount or qualityThe small gap between the walls in the old house caused cold draftsto come in.a gap in one's knowledgethere was a terrible gap in her life after her husband dieda temporary job to fill the gap between school and universityafter a gap of thirty years, the custom was reintroducedthere were some unaccountable gaps in his story"
      },
      {
        "word": "indisputable[,indis'pju:təbl]",
        "chinese": "adj. Beyond doubt; unquestionableThe members of the jury found her guilty because they found thefacts of the case indisputable.The report should distinguish clearly between indisputable fact, firm opinion and mere speculation.Parts of speech indisputably adv [,indis'pju:təbli]"
      },
      {
        "word": "intervene[,intə'vi:n]",
        "chinese": "v. To come betweenA good mediator intervenes only as much as necessary to settle adispute between other parties.Parts of speech intervention n"
      },
      {
        "word": "intuitively[in'tju:itivli]",
        "chinese": "adv. By means of a natural sense about things that are hardto observeMany mothers know intuitively when something is wrong with theirchildren.Parts of speech intuition n [,intju:'i∫n] , intuitive adj [in'tju:itiv]"
      },
      {
        "word": "recede[ri'si:d]",
        "chinese": "v. To move back or away fromAfter the age of 30, his hairline began to recede further back fromhis forehead. (hớt ra sáu (trán)to recede a few paces: lùi lại một vài bướcthe tide recedes: thuỷ triều rút xuốngto recede from an opinion: rút lui ý kiếnThe sound of the truck receded into the distance. She watched his receding figure. The prospect of bankruptcy has now receded (= it is less likely) . The pain was receding slightly. (of hair) to stop growing at the front of the head a middle-aged man with receding hair/a receding hairline Parts of speech recession n, recessive adj"
      },
      {
        "word": "retrieve[ri'tri:v]",
        "chinese": "v. To bring or get backMost dogs can be trained to retrieve objects that their owners havethrown.Parts of speech retriever n, retrievable adj"
      },
      {
        "word": "agnostic[æg'nɔstik]",
        "chinese": "adj. Believing that humans cannot know whether there is a godHis devoutly Christian parents had problems with his agnostic beliefs.Parts of speech agnostic n, agnosticism n"
      },
      {
        "word": "animism['ænimizm]",
        "chinese": "n. The belief that natural objects, such as trees, have soulsDesert cultures that practice animism often believe that winds contain spirits.Parts of speech animistic adj"
      },
      {
        "word": "atheist['eiθiist]",
        "chinese": "n. One who does not believe in the existence of a supreme beingHe argued that his scientific training made it impossible for him tobe anything but an atheist.Parts of speech atheistic adj"
      },
      {
        "word": "be inclined to[in'klaind]",
        "chinese": "v. To favor an opinion or a course of actionHe couldn’t say which candidate he favored, but he had alwaysbeen inclined to vote Republican.Parts of speech incline n, inclination n"
      },
      {
        "word": "contemplate['kɔntempleit]",
        "chinese": "v. To consider thoughtfullyIf you contemplate each step for so long, we will never complete thisproject on time.Parts of speech contemplation n, contemplative adj"
      },
      {
        "word": "deify['di:ifai]",
        "chinese": "v. To worship as a godWhen people deify the leader of their country, the leader is able toabuse power more easily.Parts of speech deity n"
      },
      {
        "word": "ecclesiastical[i,kli:zi'æstikəl]",
        "chinese": "adj. Relating to a churchHe was looking specifically for a university where he could studyecclesiastical history.Parts of speech ecclesiastic n [i,kli:zi'æstik] ecclesiastically adv [i,kli:zi'æstikəli]"
      },
      {
        "word": "exalt[ig'zɔ:lt]",
        "chinese": "v. To praise or honorHe would often exalt the virtues of his new wife.His son was exalted to a high position in the government through family connections. He was exalted as a pillar of the community. to exalt to the skies: tâng bốc lên tận mây xanhParts of speech exaltation n [,egzɔ:l'tei∫n]"
      },
      {
        "word": "pious['paiəs]",
        "chinese": "adj. Having or exhibiting religious reverenceSometimes she was so pious that the rest of us felt like heathens.Parts of speech piousness n, piety n, piously adv"
      },
      {
        "word": "sacrifice['sækrifais]",
        "chinese": "v. Anything offered to a deity as a religious thanksgiving;giving up something in order to have something more valuable later onEvery harvest time, the Fadeloni people sacrificed vegetables totheir gods as a show of thanks.In order to succeed in his career, he had to sacrifice his private lifeand his leisure time.Parts of speech sacrifice n, sacrificial adj, sacrificially adv"
      }
    ]
  },
  "Lesson-3": {
    "theme": "TOEFL Vocabulary",
    "vocabulary": [
      {
        "word": "aggravate['ægrəveit]",
        "chinese": "v. To make worse; to anger or intensifyRunning will aggravate your sore knees.Parts of speech aggravation n"
      },
      {
        "word": "decrepit[di'krepit]",
        "chinese": "adj. Weakened or worn out because of age, illness, or excessive useThe once-beautiful building was now dirty, decrepit, and roofless.a decrepit building/vehicle He was decrepit old man."
      },
      {
        "word": "disease[di'zi:z]",
        "chinese": "n. An unhealthful condition caused by an infection or a longterm physical problemThanks to developments in medicine, many once-fatal diseases cannow be cured.He has a serious lung disease."
      },
      {
        "word": "fatally['feitlli]",
        "chinese": "adv. Causing death or disasterThe soldier was fatally wounded in the battle.Parts of speech fatality n, fatal adj"
      },
      {
        "word": "forensics[fə'rensik]",
        "chinese": "n. The use of science and technology to investigate facts incriminal casesAdvances in the study of forensics have made it much easier toidentify criminals from very small traces of evidence.Parts of speech forensic adj"
      },
      {
        "word": "persist[pə'sist]",
        "chinese": "v. To continue to exist; to hold to a purpose, despite any obstacleIf your symptoms persist, you should go see a doctor.Lola persisted in her efforts to become a lawyer.Parts of speech persistence n, persistent adj"
      },
      {
        "word": "prognosis[prɔg'nousi:z]",
        "chinese": "n. An educated guess of how something will develop, especially a diseaseThe room fell silent when the doctor gave Senator Grebe a grimprognosis of months of treatment."
      },
      {
        "word": "terminal['tə:minl]",
        "chinese": "adj. Located at an end; approaching deathThe cancer ward at the hospital held both terminal and recovering patients.Parts of speech terminate v,terminally adv"
      },
      {
        "word": "vein [vein]",
        "chinese": "n. Any of the tubes that form a branching system, especially thosethat carry blood to the heartShe became fascinated with human anatomy, especially when shelearned how vein stransport oxygen."
      },
      {
        "word": "wound[wu:nd]",
        "chinese": "v. To inflict an injury onSometimes he didn’t realize his sharp humor could wound as wellas entertain.Parts of speech wound n"
      },
      {
        "word": "anesthesia[,ænis'θi:zjə]",
        "chinese": "n. Techniques for reducing sensation and feeling, especially to control painThe Civil War was the first American war when anesthesia waswidely used in surgery on soldiers.Usage tips Anesthesia and anesthetic are often used interchangeably. [,intə't∫eindʒəbli]Parts of speech anesthetic n, ad"
      },
      {
        "word": "augment['ɔ:gmənt]",
        "chinese": "v. To make bigger or better by adding toIn some types of popular cosmetic surgery people augment parts of their bodies.The college augmented its course offerings because students complained that there were too few choices.He wrote magazine articles in order to augment his income. The band had been augmented by two extra trom bonists.Parts of speech augmentation n [,ɔ:gmen'tei∫n]"
      },
      {
        "word": "certifiably ['sə:tifaiəbl]",
        "chinese": "adv. In a manner that is officially recognizedHe couldn’t be institutionalized until he was declared certifiablyinsane.Parts of speech certify v, ['sə:tifai] certification n, [,sə:tifi'kei∫n] certificate n, [sə'tifikit] certifiable adj ['sə:tifaiəbl]"
      },
      {
        "word": "complication[,kɔmpli'kei∫n]",
        "chinese": "n. A factor that makes something more difficult or complexThe surgeons could not easily stop the bleeding because of complications related to the patient’s diabetes.Parts of speech complicate v ['kɔmplikeit]"
      },
      {
        "word": "cure[kjuə]",
        "chinese": "v. To restore to healthThey say laughter can help cure many illnesses.Parts of speech cure n"
      },
      {
        "word": "implant[im'plɑ:nt]",
        "chinese": "v. To set in firmly; to insert in the body surgicallyThe actress had cheek implants to make her face look fuller.Prejudices can easily become implanted in the mind. An electrode implanted into the brain So far, only one person has survived an operation to implant an artificial heart. The embryo is placed into the uterus where it has a chance to implant. to implant ideas in the mindParts of speech implantation n"
      },
      {
        "word": "inject[in'dʒekt]",
        "chinese": "v. To insert a liquid by means of a syringeThe doctor used a needle to inject the medicine slowly into her arm.Parts of speech injection n"
      },
      {
        "word": "obese[ou'bi:s]",
        "chinese": "adj. Excessively overweightMore Americans are obese now because U.S. culture encourages [in'kʌridʒ]overeating and discourages exercise.Parts of speech obesity n"
      },
      {
        "word": "procedure[prə'si:dʒə]",
        "chinese": "n. A specific way of performing or doing somethingThe flight attendant explained the emergency evacuation procedure.What's the procedure for opening a bank account?Registering a birth or death is a straightforward procedure.Obtaining a refund from the company is a complicated procedureParts of speech proceed v,procedural ad"
      },
      {
        "word": "scar [skɑ:]",
        "chinese": "n. A mark on the skin left after a wound has healed; a lasting signof damage, either mental or physicalThe surgery was successful, but it left a large scar across her abdomen.Parts of speech scar v"
      },
      {
        "word": "astrological[,æstrə'lɔdʒikəl]",
        "chinese": "adj. Related to the study of the position of stars, the sun,and the planets in the belief that they influence earthly eventsEvery day, Mona read her astrological forecast in the newspaper,and she was careful if the horoscope predicted trouble.Parts of speech astrology n,astrologer n,astrologically adv"
      },
      {
        "word": "divination[,divi'nei∫n]",
        "chinese": "n. Foretelling the future by finding patterns in physical objectsIn Turkey, women offer divinations by reading the dregs from a coffee cup.Parts of speech divine v [di'vain]"
      },
      {
        "word": "haunt[hɔ:nt]",
        "chinese": "v. To continually appear (in the form of a ghost) in the sameplace or to the same personSome say the ghost of Princess Hilda haunts this castle, appearingas a headless form while she plays the piano.The pictures of children dying in war have haunted me for a longtime.a haunted housea spirit haunts the castle"
      },
      {
        "word": "horror['hɔ:rər] ['ha:rər]",
        "chinese": "n. Strong fear mixed with disgustOn Halloween night, all the horror movies were rented out.People watched in horror as the plane crashed to the ground.Parts of speech horrify v, horrific adj"
      },
      {
        "word": "intermediary[,intə'mi:djəri]",
        "chinese": "n. Acting as an agent between people or thingsThe plaintiff’s lawyer suggested that they hire an intermediary tohelp them discuss their case.She agreed to act as intermediary between the two tribes.The product is then sold to the end-user via an intermediary.Usage tips Intermediary comes from the Latin words meaning“between the ways.”"
      },
      {
        "word": "invoke[ɪn'voʊk]",
        "chinese": "v. To call on for supportIn many religions, believers invoke their god by holding out their hands.His name was invoked as a symbol of the revolution.Parts of speech invocation n [,invou'kei∫n]"
      },
      {
        "word": "meditate['medɪteɪt]",
        "chinese": "v. To reflect; to think quietly and deeply for a long timeEvery morning, the monks meditated for three hours in complete silence.They were meditating revence.Parts of speech meditation n [,medi'tei∫n]"
      },
      {
        "word": "phantom['fæntəm]",
        "chinese": "n. A dimly visible form, usually thought to be the spirit of adead person, a sunken ship, etc.Many visitors reported seeing a phantom who appeared around the lake.Usage tips Phantom originates in a word meaning “dream”; like adream, a phantom leaves an observer wondering whether it’s real ornot."
      },
      {
        "word": "psychic['saɪkɪk]",
        "chinese": "adj. Relating to the supposed ability of the human mind tosense things that cannot be observedThe governor’s assistant claimed to have unique psychic abilitiesenabling him to read people’s minds.She claims to be psychic and helps people to contact the dead. How am I supposed to know - I'm not psychic! Parts of speech psychic n, psychically adv"
      },
      {
        "word": "self-perpetuating[,selfpə'petju:eitiη]",
        "chinese": "adj. Having the power to renew oneself for an indefinite period of timecontinuing without any outside influence It is difficult to escape from a lie, as they are often self-perpetuating.Revenge leads to a self-perpetuating cycle of violence. Parts of speech self-perpetuation n"
      },
      {
        "word": "assimilate[ə'simileit]",
        "chinese": "v. To consume and incorporate; to become similarNot all of the overseas students could assimilate into the rigidlycontrolled school.Many new immigrants have not yet assimilated fully into the new culture.The committee will need time to assimilate this report. Some people can only assimilate change gradually. New arrivals find it hard to assimilate. Immigrants have been successfully assimilated into the community. These changes were gradually assimilated into everyday life. Usage tips Assimilate is often followed by into.Parts of speech assimilation n"
      },
      {
        "word": "cremation[kri'mei∫n]",
        "chinese": "n. The act of burning the deadCremation is particularly common in Japan, where land for burial isvery limited.More people are choosing cremation rather than burial.Parts of speech cremate v [kri'meit]"
      },
      {
        "word": "domesticate[də'mestikeit]",
        "chinese": "v. To make something suitable for being in a homeThe Barnes family hoped to domesticate the tiger, but their neighbors were skeptical.He is thoroughly domesticated and cooks a delicious chicken casserole. These animals are only partly domesticated.Some men are very hard to domesticate. Usage tips The object of domesticate is usually a plant or animal.Parts of speech domestic adj"
      },
      {
        "word": "folklore['fouklɔ:]",
        "chinese": "n. Traditional myths of a people transmitted orallyThrough folklore, archaeologists have learned about the migrationof Native Americans in North America.Parts of speech folkloric adj"
      },
      {
        "word": "fossilize['fɔsilaiz]",
        "chinese": "v. To become preserved in clay or stone or ash after death, sothat a natural record is left of the original organism; to become rigidand stuck in old waysThe dinosaur eggs had fossilized over thousands of years.Parts of speech fossilization n, fossil n"
      },
      {
        "word": "relic['relik]",
        "chinese": "n. Something left from a long-ago culture, time period, or personRelics of the war can still be found in the sand dunes along thisshore."
      },
      {
        "word": "rite [rait]",
        "chinese": "n. A ceremony meant to achieve a certain purposeMany cultures have fertility rites that supposedly make it morelikely for women to bear children.funeral (burial) rites: lễ tangthe rites of hospitality: nghi thức đón khách"
      },
      {
        "word": "ritually['rit∫uəli]",
        "chinese": "adv. As part of a traditional ceremony or habitThe children ritually kissed their parents on the cheek before bed.Parts of speech ritual n, ritual adj"
      },
      {
        "word": "saga['sɑ:gə]",
        "chinese": "n. A long story about important events long agoMany American families tell sagas about their ancestors’ arrival inthe United States."
      },
      {
        "word": "vestige['vestidʒ]",
        "chinese": "n. A visible trace that something once existedThe wilted flowers were the only vestige of their romantic weekend."
      },
      {
        "word": "amend [ə'mend]",
        "chinese": "v. To change for the betterThe residents voted to amend their neighborhood policy on fences.Parts of speech amendment n"
      },
      {
        "word": "biased['baiəs]",
        "chinese": "adj. Leaning unfairly in one directionHer newspaper article was criticized for being heavily biasedtoward the mayor’s proposal.Parts of speech bias n"
      },
      {
        "word": "burden['bə:dn]",
        "chinese": "n. Something that is carried; a source of stress or worryThe donkey walked slowly under the burden of its heavy load.The failing company faced the burden of bad debts and a poor reputation.Parts of speech burden v"
      },
      {
        "word": "counter ['kauntə]",
        "chinese": "v. To act in opposition to; to offer in responseThe hockey player countered the punch with a smashing blow fromhis hockey stick.Jane countered every accusation with a specific example of herachievements.Parts of speech counter n, counter adj"
      },
      {
        "word": "de facto[di:'fæktou]",
        "chinese": "adj. Truly doing a job, even if not officiallyPopular support established the Citizens Party as the de facto government.De facto recognition of a state: sự công nhận một quốc gia trên thực tế (không chính thức)De facto standard: chuẩn phổ biến (nhưng không chính thức)Parts of speech de facto adv"
      },
      {
        "word": "discriminate[dis'krimineit]",
        "chinese": "v. To choose carefully among optionsThe governor wisely discriminated between urgent issues and thosethat could wait.Parts of speech discriminatory adj, discriminate adj"
      },
      {
        "word": "notion['nou∫n]",
        "chinese": "n. A belief; a fanciful impulseThe notion that older office equipment is unreliable is inaccurate.One morning, she suddenly took the notion to paint her kitchen red.Usage tips Notion can be followed by a thatclause or a tophrase."
      },
      {
        "word": "oppress[ə'pres]",
        "chinese": "v. To keep down by force; to weigh heavily onFactory management oppressed workers through intimidation.oppressed with poverty: sự nghèo khổ đè nặngParts of speech oppression n"
      },
      {
        "word": "paradigm['pærədaim]",
        "chinese": "n. A pattern or model; a set of assumptionsThe usual paradigm for economic growth in developed countriesdoes not apply to some poor nations.Usage tips Paradigm is often followed by for."
      },
      {
        "word": "prejudiced['predʒudisid]",
        "chinese": "adj. Causing to judge prematurely and unfairlyMany consumers are prejudiced against commercial goods made inthird-world countries.Parts of speech prejudice v,prejudice n"
      }
    ]
  },
  "Lesson-4": {
    "theme": "TOEFL Vocabulary",
    "vocabulary": [
      {
        "word": "curriculum[kə'rikjuləm]",
        "chinese": "n. The courses of study offered by an educational institutionThe teachers met to design a new curriculum for the Intensive English Program.Is French on your school's curriculum?"
      },
      {
        "word": "distinctly[dis'tiηktli]",
        "chinese": "adv. ClearlyI distinctly remember saying that we would meet at noon.Parts of speech distinction n, distinct adj"
      },
      {
        "word": "erudite ['eru:dait]",
        "chinese": "adj. Highly educatedEven though Stella was only a freshman, she was considered eruditeby both her classmates and her professors.an erudite lecture: một bài giảng uyên bác"
      },
      {
        "word": "fortify ['fɔ:tifai]",
        "chinese": "v. To strengthenThe high-priced drink had extra vitamins and minerals to fortifythe body.to fortify one's couragefortified wine rượu pha thêm rượu mạnhParts of speech fortification n"
      },
      {
        "word": "implicitly [im'plisitli]",
        "chinese": "adv. Without being stated; unquestioninglyBy joining the competition, she agreed implicitly to the rules.I trust my mother implicitly: tôi hoàn toàn tin tưởng mẹ tôiParts of speech implicit adj"
      },
      {
        "word": "parochial[pə'roukəl]",
        "chinese": "adj. Restricted in outlook; relating to the local parishMarla moved from her rural community to get away from itsparochial thinking.Sending your children to a parochial school can cost as much assending them to college.They need to be better informed and less parochial in their thinking."
      },
      {
        "word": "rigor ['raigɔ:]",
        "chinese": "n. Strictness; difficult situations that come from following rulesstrictlyThe wrestler followed his diet with rigor.The rigors of military life toughened the young men quickly.Parts of speech rigorous adj"
      },
      {
        "word": "roster ['roustə]",
        "chinese": "n. A list, especially of namesTwo of the names on the roster were misspelled."
      },
      {
        "word": "secular ['sekjulə]",
        "chinese": "adj. Worldly rather than spiritual; not related to religionFew private schools in the United States are secular."
      },
      {
        "word": "suspend [sə'spend]",
        "chinese": "v. To cause to stop for a period; to hang as to allow free movementThe trial was suspended when the judge learned that one of the jurymembers knew the defense lawyer.The circus acrobat was suspended in mid air.Parts of speech suspension n,suspension adj"
      },
      {
        "word": "allegiance[ə'li:dʒəns]",
        "chinese": "n. LoyaltyMy allegiance to my country is based on respect for its principles.Usage tips Allegiance is commonly followed by a tophrase."
      },
      {
        "word": "artillery [ɑ:'tiləri]",
        "chinese": "n. Large guns that shoot powerful shells; army units that handle such gunsAn artillery barrage broke down the city’s thick walls within seconds.The 47th Artillery fired on rebels camped in the city center.Usage tips When it means a part of an army, artillery is sometimesplural."
      },
      {
        "word": "battle['bætl]",
        "chinese": "v. To fight againstThe Viet Minh battled French forces at Dien Bien Phu for nearlytwo months in 1954.I'm battling with my employers for a pay-riseParts of speech battle n"
      },
      {
        "word": "cease [si:s]",
        "chinese": "v. StopThe lightning continued even after the thunder had ceased.Usage tips Cease is found in official statements, not usually ineveryday speech.Parts of speech cessation n, ceaseless adj"
      },
      {
        "word": "hierarchy['haiərɑ:ki]",
        "chinese": "n. A system of levels that places people high or low according to their importanceStarting as a lowly private, Burt Jones gradually rose through thehierarchy of the army.Usage tips Hierarchy is often followed by an ofphrase.Parts of speech hierarchical adj, hierarchically adv"
      },
      {
        "word": "in the trenches [trent∫]",
        "chinese": "adv’l. In the middle of the hardest fighting or workWith their unrealistic view of this war, our generals don’t knowwhat things are like out in the trenches.Usage tips Creates an image of soldiers fighting in a long, dug-outplace in the battlefield."
      },
      {
        "word": "mobilize['moubilaiz]",
        "chinese": "v. To put members of a group into motionAfter a terrible storm, the governor mobilized the National Guardto rescue victims.Parts of speech mobilization n"
      },
      {
        "word": "rank [ræηk]",
        "chinese": "v. To put into a many-leveled order, depending on importance orachievementThe Marines ranked Jim Hurst highest among all their officer candidates.Parts of speech rank n"
      },
      {
        "word": "ratio ['rei∫iou]",
        "chinese": "n. The relationship of one number or amount to anotherMilitary analysts say that the ratio of attackers to defenders in abattle should be about three to one for the attackers to win.Usage tips Ratio is very often followed by an of...to structure."
      },
      {
        "word": "strategic [strə'ti:dʒik]",
        "chinese": "adj. Related to long-term plans for achieving a goalThe United States has formed strategic friendships with Tajikistanand Mongolia to have Central Asian bases in the future.Usage tips Strategic is often used with nouns for plans.Parts of speech strategy n,strategize v, strategically adv"
      },
      {
        "word": "annex [ə'neks]",
        "chinese": "v. To make something (usually land) part of another unitBardstown grew by annexing several farms at the north edge of town.Parts of speech annexation n, annex n"
      },
      {
        "word": "apex ['eipeks]",
        "chinese": "n. The highest pointGregory knew that his running skills had to be at their apex duringthe tournament.Usage tips Apex is often used to describe the high point of someone’sabilities."
      },
      {
        "word": "collapse (v)[kə'læps]",
        "chinese": "v. To fall down, usually because of weaknessThe roof collapsed under the weight of snow. He collapsed in the street and died two hours later. When I get home I like to collapse on the sofa and listen to music. Talks between management and unions have collapsed. All opposition to the plan has collapsed. of prices/currencies Share prices collapsed after news of poor trading figures. The table collapses for easy storage. medical Parts of speech collapse n, collapsible adj"
      },
      {
        "word": "collapse (n)[kə'læps]",
        "chinese": "1. [countable, usually singular, uncountable] a sudden failure of sth, such as an institution, a business or a course of action The collapse of law and order in the area The peace talks were on the verge of collapse. 2. [uncountable ] the action of a building suddenly falling The walls were strengthened to protect them from collapse. 3. [uncountable, countable, usually singular] a medical condition when a person suddenly becomes very ill/sick, or when sb falls because they are ill/sick or weak a state of mental/nervous collapse She was taken to hospital after her collapse at work. 4. [countable, usually singular] a sudden fall in value the collapse of share prices/the dollar/the market"
      },
      {
        "word": "conquest ['kɔηkwest]",
        "chinese": "n. A takeover by force or continued effortThe first recorded conquest of Mt. Everest was by Tensing Norgayand Sir Edmund Hilary.Usage tips Conquest is usually followed by an ofphrase.Parts of speech conquer v"
      },
      {
        "word": "devise[di'vaiz]",
        "chinese": "v.To find an original way to make an object or a planThe soldiers devised a way to cross the river into enemy territorywithout being seen.Parts of speech device n"
      },
      {
        "word": "invasive [in'veisiv]",
        "chinese": "adj. Aggressively entering into someone else’s territorySurgery with a laser is less invasive than surgery with a knife orscalpel.Parts of speech invade v, invasion n, invader n"
      },
      {
        "word": "prevailing[pri'veiliη]",
        "chinese": "adj. Strongest or most commonThe prevailing attitude among our neighbors is to be friendly butnot too friendly.Parts of speech prevail v,prevalence n"
      },
      {
        "word": "resist [ri'zist]",
        "chinese": "v. To refuse to give in to a strong force or desireAlthough many native nations resisted, the U.S. government eventually took over almost all Indian land.Parts of speech resistance n, resistant adj"
      },
      {
        "word": "severely [si'viəli]",
        "chinese": "adv. Harshly; extremelyCommanders severely punished any soldier who criticized the battleplan.Parts of speech severity n,severe adj"
      },
      {
        "word": "violation [,vaiə'lei∫n]",
        "chinese": "n. An action that breaks a law or agreement; mistreatmentof something that deserves respectThe army’s testing of new weapons was a violation of the cease-fireagreement.The sculptures at Mt. Rushmore may be a violation of sacred Indian land.Usage tips Violation is often followed by an ofphrase.Parts of speech violate v,violator n"
      },
      {
        "word": "chronologically [,krɔnə'lɔdʒikəli]",
        "chinese": "adv. In order according to timeAllen’s book is arranged chronologically, from the First Crusade in1095 to the fall of Granada in 1492.Usage tips Chronologically is often used with arranged, organized,listed,or some other word for order.Parts of speech chronology n, chronological adj"
      },
      {
        "word": "coincide [,kouin'said]",
        "chinese": "v. Happen or exist at the same timeThe Viking attacks on western Europe coincided with an abnormally warm period in the Earth’s climate.Usage tips Coincide is often followed by a with phrase.Parts of speech coincidence n, coincidental adj, coincidentally adv"
      },
      {
        "word": "consequence ['kɔnsikwəns]",
        "chinese": "n. A result, often one much later in time than the causeOne consequence of global warming may be the flooding of lowlying islands.Usage tips Consequence usually implies something negative orserious about the result.Parts of speech consequent adj, consequently adv"
      },
      {
        "word": "core [kɔ:]",
        "chinese": "n. an area or object at the centerThe core of India’s film industry is in Bombay, where all but a fewfilm studios are located.Usage tips Core is often followed by another noun (e.g.,core principle) or by an of phrase."
      },
      {
        "word": "deny[di'nai]",
        "chinese": "v. Say that something is not trueMovie star Allen Butcher denied that he and the Princess of Denmark were getting married.Usage tips Deny is often followed by the -ing form of a verb or by athat clause.Parts of speech denial n,deniably adv"
      },
      {
        "word": "diminish[di'mini∫]",
        "chinese": "v. Make something smaller or weaker; become smaller or weakerThe Protestant Reformation diminished the power of the RomanCatholic Pope.Mr. Partridge’s influence in the company diminished after he relocated to a branch office."
      },
      {
        "word": "longitude ['lɔndʒitju:d]",
        "chinese": "n. A system of imaginary lines running from north to southalong the Earth’s surface, where each line is numbered from 0º to180°west or eastThe prime meridian, a line running through Greenwich, England, ismarked as 0°longitude.Parts of speech longitudinal adj, longitudinally adv - compare with latitude (noun)"
      },
      {
        "word": "milieu[mi:'ljɜ:]",
        "chinese": "n. General environment or surroundingsMany Vietnam veterans did not feel comfortable in the antiwar social milieu of the 1970s."
      },
      {
        "word": "Orwellian[ɔrweliən]",
        "chinese": "adj. Frightening and overcontrolled by a government thatinterferes in nearly every aspect of personal lifeBiometric devices like eye-scanners allow an Orwellian level of government knowledge about everyone’s location."
      },
      {
        "word": "reconciliation [,rekən,sili'ei∫n]",
        "chinese": "n. Coming back together peacefully after having beenenemiesSouth Africa avoided a bloodbath after apartheid by setting up aTruth and Reconciliation Commission.The reconcilement of ideas: sự điều hòa những ý nghĩParts of speech reconcile v,reconciliatory adj reconciliation = reconcilement ['rekənsailmənt]"
      },
      {
        "word": "allocate ['æləkeit]",
        "chinese": "v. To give out different amounts for different purposesThe budget allocates $58 billion to the military and only about $2 billion to education.Usage tips Things that can be allocated are things that can be“spent”—money, time, energy, etc.Parts of speech allocation n"
      },
      {
        "word": "commodity [kə'mɔditi]",
        "chinese": "n. A thing that can be bought and sold, such as grain, oil, or woodTulip bulbs were one of the most valuable commodities in seventeenth-century Holland.Usage tips A thing is called a commodity only in the context of buying or selling it."
      },
      {
        "word": "decline[di'klain]",
        "chinese": "v. To decrease in power or amountAmerica’s railroads declined because the automobile dominatedAmerican life.Parts of speech decline n"
      },
      {
        "word": "equity ['ekwiti]",
        "chinese": "n. The value of one’s share in an investmentBarnard’s equity in the business was one-third, or about $350,000.Usage tips In this meaning, equity is always singular and usuallyfollowed by an inphrase."
      },
      {
        "word": "inflation [in'flei∫n]",
        "chinese": "n. A situation in which prices for many items rise quite fastDuring the rapid inflation of the 1970s, prices for food and fuelsometimes rose 20 percent in a single month.Parts of speech inflate v, inflationary adj"
      },
      {
        "word": "net[net]",
        "chinese": "adj. After all costs have been subtracted from an amountMy gross salary is around $35,000, but my net pay is closer to$29,000.Parts of speech net v,net n"
      },
      {
        "word": "per capita[pə 'kæpitə]",
        "chinese": "adv. For each personResearch shows we’re likely to sell 15 light bulbs per capita peryear in medium-sized cities.Parts of speech per capita adj"
      },
      {
        "word": "regulate ['regjuleit]",
        "chinese": "v. Control according to a set of rulesTrading on the New York Stock Exchange is regulated by officials ofthe exchange and by federal law.Parts of speech regulation n, regulatory ad"
      },
      {
        "word": "subsidy ['sʌbsidi]",
        "chinese": "n. Money given by a government or other organization to support an activityFederal subsidies to grain farmers have helped them stay in businessdespite three years of bad weather.Parts of speech subsidize v"
      }
    ]
  },
  "Lesson-5": {
    "theme": "TOEFL Vocabulary",
    "vocabulary": [
      {
        "word": "tangible ['tændʒəbl]",
        "chinese": "adj. Obviously real because it can be seen, touched, or otherwise observedOne tangible benefit of putting electrical cables underground is aclearer view of the sky."
      },
      {
        "word": "accumulate [ə'kju:mjuleit]",
        "chinese": "v. To build up a large amount of somethingOver several generations, the Hardington family accumulated vastwealth by buying and selling land.Parts of speech accumulation n"
      },
      {
        "word": "affluence ['æfluəns]",
        "chinese": "n. Wealth and the style of life that goes with itMohadzir grew up amid affluence, which poorly prepared him forhis grad student days in crowded apartments with no servants.Parts of speech affluent adj"
      },
      {
        "word": "elite [eɪlit]",
        "chinese": "adj. Belonging to a special, honored groupMessner is an elite climber who recently ascended an 8,000-metermountain without extra oxygen.Parts of speech elite n,elitist adj"
      },
      {
        "word": "impoverish [im'pɔvəri∫]",
        "chinese": "v. To make a person or group poorThe collapse of the steel industry impoverished several counties ineastern Ohio.Parts of speech impoverishment n"
      },
      {
        "word": "luxury ['lʌk∫əri]",
        "chinese": "n. Extreme comfort, beyond what anyone needsAutomakers try to give their cars an image of luxury by including extras like heated seats and satellite tracking systems.Parts of speech luxuriate v,luxurious adj"
      },
      {
        "word": "nobility[nou'biliti]",
        "chinese": "n. A group of socially prominent people with special titles given by a king or queen, such as “duke” or “countess”In the Middle Ages, the nobility supposedly followed a code that required them to take care of poorer people who lived near their estates.Usage tips Nobility is used as a name for a group of distinguishedpeople; it can also mean “a highly dignified form of behavior.”Parts of speech noble n,noble adj"
      },
      {
        "word": "prestige[pre'sti:ʒ]",
        "chinese": "n. Honor and respect for being better than the averageThe Grassleys enjoyed the prestige of living in the historic town, butthey did not feel at home there.Parts of speech prestigious adj"
      },
      {
        "word": "privileged['privəlidʒd]",
        "chinese": "adj. Able to enjoy special advantages because of one’s position (usually because of being born into a wealthy or powerfulfamily)Despite his privileged position in one of America’s most powerfulfamilies, the politician tried to portray himself as an ordinary person.Parts of speech privilege n"
      },
      {
        "word": "prosper['prɔspə]",
        "chinese": "v. To do very well in one’s business or personal lifeVargas prospered after finally patenting his new inventions.Usage tips A person can prosper; so can a group, a company, or anarea.Parts of speech prosperity n, prosperous adj"
      },
      {
        "word": "working class['wə:kiη'klɑ:s]",
        "chinese": "n. People with low-paying (often unskilled) jobs who are not poor but who are not securely in the middle classThe Farrelly family, like other members of the working class, wereproud of their jobs and did not want any handouts from charity orthe government."
      },
      {
        "word": "acquire [ə'kwaiə]",
        "chinese": "v. To get something, usually something with special value or meaningBart hoped to acquire the 1898 D Indian Head penny, which wouldmake his collection complete.Usage tips Unlike get, acquire implies that a possession has specialvalue or meaning.Parts of speech acquisition n,acquisitive adj"
      },
      {
        "word": "assess [ə'ses]",
        "chinese": "v. To estimate the value of something The Barnes building was assessed at $1.3 million, but it can probably sell for much more than that.Parts of speech assessor n,assessment n"
      },
      {
        "word": "asset ['æset]",
        "chinese": "n. A possession that has positive valueIn his job, patience is an invaluable asset. Being able to speak a foreign language is a major asset. I'm not sure if his forcefulness is an asset or a liability. ~ to sb/sth She'll be an asset to the team. the net asset value of the company Her assets include shares in the company and a house in France. real assets: bất động sảnUsage tips Some examples of assets are real estate, cash, and stockshares."
      },
      {
        "word": "hazardous['hæzədəs]",
        "chinese": "adj. DangerousParents have to be careful not to buy children’s clothes and toysmade of hazardous materials.Parts of speech hazard n ,hazardously adv"
      },
      {
        "word": "jointly ['dʒɔintli]",
        "chinese": "adv. Together with one or more other partiesIn most states, a husband and wife are assumed to own all theirpossessions jointly.Parts of speech join v, joint n"
      },
      {
        "word": "lease [li:s]",
        "chinese": "v. To rent something for a long time (several months or years)Some drivers prefer to lease a car rather than buy one.Parts of speech lease n,lessor n,lessee n"
      },
      {
        "word": "liability [,laiə'biliti]",
        "chinese": "n. Legal responsibility for harming a person or property; a disadvantageBefore you go river rafting, you sign a document releasing the tripleaders from liability in case of injury.Henderson is just a liability to our work team, because he never finishes anything on time.Usage tips In its second meaning, liability is often followed by a to phrase.Parts of speech liable adj"
      },
      {
        "word": "proprietor[prə'praiətə]",
        "chinese": "n. Owner, usually of a business or a buildingThe proprietor of Hekman’s Windows is Nels Hekman, grandson ofthe people who established the factory.Usage tips Very often, proprietor is followed by an ofphrase.Parts of speech proprietary adj"
      },
      {
        "word": "safeguard ['seifgɑ:d]",
        "chinese": "v. To protectA burglar-alarm system safeguards our house when we go away on vacation.Usage tips Safeguard implies continuous protection over a long time."
      },
      {
        "word": "sole [soul]",
        "chinese": "adj. OnlyMany people have wanted to invest in Harry’s publishing business,but he remains the sole owner.Usage tips Sole almost always appears before the noun it modifies. Itdoes not come after a linking verb like be.Parts of speech solely adv"
      },
      {
        "word": "compensate ['kɔmpenseit]",
        "chinese": "v. To give an employee money or other things in exchangefor the work he or she doesMy pay doesn’t properly compensate me for my efforts, but myother benefits, like health insurance, fill in the gap.Usage tips Compensate is often followed by a forphrase.Parts of speech compensation n, compensatory adj"
      },
      {
        "word": "dynamic[dai'næmik]",
        "chinese": "adj. Full of energyThis job requires a dynamic person, someone who will look for opportunities instead of just waiting around for them.Parts of speech dynamism n, dynamically adv"
      },
      {
        "word": "enterprising ['entəpraiziη]",
        "chinese": "adj. Creative in thinking of ways to make moneyImmigrants are often among the most enterprising members of society, partly because anyone brave enough to make an overseas move is likely to be a risk-taker.Parts of speech enterprise n(Note:There is no verb “to enterprise.”)"
      },
      {
        "word": "exploit ['eksplɔit]",
        "chinese": "v. To take advantage of; to treat inconsiderately in order to profitThe company tried to exploit the low interest rates to expand operations.The foreign mining company exploited our copper resources andthen simply left.Parts of speech exploitation n,exploitive adj"
      },
      {
        "word": "incentive [in'sentiv]",
        "chinese": "n. A possible benefit that motivates a person to do a certain thingThis city’s willingness to support its public schools gave us an incentive to move here with our two young children.Usage tips Incentive is usually followed by a tophrase."
      },
      {
        "word": "industrious [in'dʌstriəs]",
        "chinese": "adj. Willing to work hardThe Dutch settlements in Ottawa County were founded by industriousfarmers who objected to frivolous behavior such as dancing.Usage tips Only people can be industrious;companies cannot.Parts of speech industriousness n,industriously adv"
      },
      {
        "word": "marginal['mɑ:dʒinl]",
        "chinese": "adj. Not very significant or effectiveOur new advertising campaign had only marginal success, raisingsales by a mere 3 percent.There has been a marginal improvement in weather conditions.Parts of speech marginally adv"
      },
      {
        "word": "merit['merit]",
        "chinese": "n. Value; success based on one’s work, not on luckPay raises at our company are based on merit, as determined by acommittee of managers.Usage tips Merit is uncountable.Parts of speech merit v,meritorious adj"
      },
      {
        "word": "promote[prə'mout]",
        "chinese": "v. To move someone to a higher position in a companyBecause of his excellent handling of the Vredeman account, JimHarris was promoted to vice president.Usage tips Promote is very often followed by a to phrase indicatingthe position one has been moved up to.Parts of speech promotion n"
      },
      {
        "word": "resign [,ri:'zain]",
        "chinese": "v. To quit one’s jobBecause of controversy over his leadership style, Morton resignedfrom his job as president.Parts of speech resignation n"
      },
      {
        "word": "distill[dis'til]",
        "chinese": "v. to remove one liquid from a mixture of liquids by boiling; toget something valuable from a confusing mix of ideasThe forest peoples of Southeast Asia distill an alcoholic drink calledarak from a paste of palm berries.Most students are confused by her lectures, but Joe can always distill her main idea.Parts of speech distillation n, distillery n"
      },
      {
        "word": "entrepreneurial [,ɔntrəprə'nə:riəl]",
        "chinese": "adj. Able to create business opportunities from a widevariety of circumstancesMany engineers of the 1970s made great computers, but only a fewwere entrepreneurial enough to see the business possibilities in thenew machines.Parts of speech entrepreneur n"
      },
      {
        "word": "extract (n) ['ekstrækt](v) [iks'trækt]",
        "chinese": "v. To take outInternational mining companies came to the Malay Peninsula to extract the region’s massive tin deposits.Parts of speech extraction n,extractor n"
      },
      {
        "word": "haggle['hægl]",
        "chinese": "v. To argue back and forth about a priceThe customer and the shopkeeper haggled over the silver plate formore than an hour.Usage tips Haggle is often followed by a phrase with over or about.Parts of speech haggler n"
      },
      {
        "word": "intrepid [in'trepid]",
        "chinese": "adj. FearlessFor nearly 200 years, only the most intrepid colonists would crossthe Appalachian Mountains."
      },
      {
        "word": "merchant['mə:t∫ənt]",
        "chinese": "n. A person who makes a living by selling thingsThe spice merchants of the eastern markets charged top prices tothe Dutch and British sailors, who had come too far to sail awaywithout buying.Usage tips The word merchant might be preceded by another nountelling what the merchant sells (e.g., spice merchant or winemerchant).Parts of speech merchandise v, merchandise n, mercantile adj"
      },
      {
        "word": "proportionately[prə'pɔ:∫ənətli]",
        "chinese": "adv. In an amount appropriate to each of several recipientsThe food aid was distributed proportionately per family, with largerfamilies receiving more.Costs have risen, and prices will rise proportionately.chi phí đã tăng, và giá cả sẽ tăng theo tỉ lệ tương ứngParts of speech proportion n,proportionate adj, proportionally adv"
      },
      {
        "word": "prototype['proutətaip]",
        "chinese": "n. The first one made of a machine or systemThe airplane manufacturer uses robots to test every prototype, justin case there is a problem with the design."
      },
      {
        "word": "reward [ri'wɔ:d]",
        "chinese": "n. Something one gets for having done wellThe greatest reward of being a parent is to see your child make awise decision.Usage tips Reward might be followed by an ofor for phrase namingwhat one has done well.Parts of speech reward v"
      },
      {
        "word": "shuttle ['∫ʌtl]",
        "chinese": "v. To move back and forth often between two placesThe small jet shuttles between Kuala Lumpur and Singapore nearlyevery two hours.Parts of speech shuttle n"
      },
      {
        "word": "advocate ['ædvəkit]",
        "chinese": "v. To speak out in favor of somethingSome environmentalists advocatere moving large dams from the Columbia River.Usage tips Advocate is usually followed by a term for a process oraction, very often the -ing form of a verbParts of speech advocate n, advocacy n"
      },
      {
        "word": "authority [ɔ:'θɔriti]",
        "chinese": "n. The power to make decisions, to tell others what to do.The governor has the authority to call the legislature together foremergency sessions.Usage tips A to phrase often follows authority.Parts of speech authorize v,authoritative adj"
      },
      {
        "word": "bitterly['bitəli]",
        "chinese": "adv. Strongly and with a lot of bad feelingsSenator Thomas bitterly opposed the movement to design a newstate flag.The widow smiles bitterly to her neighbours.Parts of speech bitterness n,bitter adj"
      },
      {
        "word": "candidate ['kændidit]",
        "chinese": "n. Someone who wants to be chosen, especially in an election, for a positionIn most U.S. elections, there are only two major-party candidates forpresident.Usage tips Candidate is often followed by a for phrase.Parts of speech candidacy n"
      },
      {
        "word": "coalition [,kouə'li∫n]",
        "chinese": "n. A group of several different groups or countries that areworking together to achieve a certain goal.Several local churches, mosques, synagogues, and temples formed a coalition to promote understanding among people of different religions."
      },
      {
        "word": "contest [kən'test]",
        "chinese": "v. To challengeDave Roper, who narrowly lost the mayor’s race, contested the results, demanding a recount of the votes.Usage tips The noun contest can mean a game, especially one playedfor a prize.Parts of speech contest n"
      },
      {
        "word": "election [i'lek∫n]",
        "chinese": "n. A process in which people choose officialsBecause of problems with vote-counting four years ago, international observers monitored this year’s election to make sure it was fair.Parts of speech elect v,elective adj"
      },
      {
        "word": "inaugurate [i'nɔ:gjureit]",
        "chinese": "v. To bring into public office; to start formallyThe U.S. president is elected in November but is not inaugurateduntil the following January.An effort to bring electric service to farms and small towns was inaugurated with the Rural Electrification Act of 1936.Usage tips When it means “bring into public office,” inaugurate isusually in the passive voice.Parts of speech inauguration n,inaugural adj"
      },
      {
        "word": "policy['pɔləsi]",
        "chinese": "n. An approved way for approaching a certain kind of situationThe policy said that government money could not be given to any private hospital."
      }
    ]
  },
  "Lesson-6": {
    "theme": "TOEFL Vocabulary",
    "vocabulary": [
      {
        "word": "poll[poul]",
        "chinese": "v. To find out a small group’s opinion so that you can guess whata much larger group thinksThe newspaper polled 500 registered voters and found that only 27percent were in favor of expanding the city zoo.Of those polled, seven out of ten said they preferred brown bread: trong số những người được thăm dò ý kiến, cứ mưới người thì có bảy người cho biết là họ thích bánh mì đen hơnParts of speech poll n,pollster n"
      },
      {
        "word": "accuse [ə'kju:z]",
        "chinese": "v. To say that someone did something wrong (e.g., committed a crime)Jordan was accused of using a stolen credit card to buy about $300worth of electronic equipment.Usage tips Accuse is often used in the passive voice.Parts of speech accusation n, accuser n"
      },
      {
        "word": "allegedly [ə'ledʒidli]",
        "chinese": "adv. According to what people sayThe chief financial officer of the company allegedly took companymoney for his personal use.The novel was allegedly written by a computer: người ta cho rằng cuốn tiểu thuyết này là do một máy điện toán viết raParts of speech allege v,allegation n"
      },
      {
        "word": "civil ['sivl]",
        "chinese": "adj. Involving a dispute between two citizens, not a criminal chargeIn a civil suit against his neighbor, Barney claimed that the neighbor’s dog had bitten him.Usage tips In a court context, civil almost always appears in one ofthe following phrases: civil suit, civil action, civil court, civilproceedings, and civil penalties."
      },
      {
        "word": "convict ['kɔnvikt]",
        "chinese": "v. To decide that someone is guilty of a crimeDean was convicted of assault after the jury saw a video of himstriking another man.Usage tips Convict is often used in the passive voice.Parts of speech convict n, conviction n"
      },
      {
        "word": "guilty ['gilti]",
        "chinese": "adj. Responsible for doing something badThe jury found that the director was guilty of embezzlement.Usage tips Guilty is often followed by an ofphrase that names acrime or bad deed.Parts of speech guilt n,guiltily adv"
      },
      {
        "word": "offense[ə'fens]",
        "chinese": "n. A specific act that breaks the lawConvicted twice of reckless driving,Victor will lose his license if hecommits another serious traffic offense.Parts of speech offender n, offensive adj"
      },
      {
        "word": "peer[piə]",
        "chinese": "n. A person who is one’s social equalIn requiring judgment by “a jury of one’s peers,” U.S. law meant toprotect lower-class defendants from the possibly biased judgment ofupper-class juries."
      },
      {
        "word": "suspect [sə'spekt]",
        "chinese": "n. Someone who, in the opinion of the police, might have committed a certain crimeThe police were investigating the activities of five suspects in theliquor-store robbery.Parts of speech suspect v, suspicion n, suspicious adj, suspiciously adv"
      },
      {
        "word": "verdict ['və:dikt]",
        "chinese": "n. A judgment in a court caseIt took the jury only 30 minutes to reach a verdict of “guilty.”Usage tips Verdict is often the object of the verbs reach or arrive at."
      },
      {
        "word": "witness['witnis]",
        "chinese": "v. To see something, especially a crime, happenAfter witnessing the car theft, Rodney called the police.Parts of speech witness n"
      },
      {
        "word": "apprehend [,æpri'hend]",
        "chinese": "v. To captureThe police apprehended the robbery suspect as he tried to get on a bus to Chicago.Parts of speech apprehension n"
      },
      {
        "word": "ascertain [,æsə'tein]",
        "chinese": "v. To make sure ofThe police failed to ascertain that the man they arrested was the Gregory Brown they were really looking for.Usage tips Ascertain is often followed by a that clause. Notice thatthe root of the word is the adjective certain, meaning “sure.”"
      },
      {
        "word": "bureaucratic[,bjuərə'krætik]",
        "chinese": "adj. Related to a large organization with a lot of complicated proceduresBefore I could speak with the chief, I had to go through a bureaucratic run around of identity checks and written requests.Usage tips Bureaucratic implies that something is inefficient andunnecessarily complicated.Parts of speech bureaucracy n"
      },
      {
        "word": "condemn [kən'dem]",
        "chinese": "v. To speak out against something in very strong termsReligious radicals condemned the government for allowing alcoholto be sold in restaurants.Parts of speech condemnation n"
      },
      {
        "word": "evidence ['evidəns]",
        "chinese": "n. Something that makes the truth of a statement seem more likelyThe most convincing evidence that Garner robbed the store was avideotape from surveillance cameras.Parts of speech evidence v,evident adj,evidently adv"
      },
      {
        "word": "implicate ['implikeit]",
        "chinese": "v. To suggest that someone was involved in a crime or other wrong behaviorNo group claimed responsibility for the bombing, but the type ofexplosive used implicates the Heartland Freedom Militia.Usage tips Implicate is often followed by in.Parts of speech implication n"
      },
      {
        "word": "inquiry [in'kwaiəri]",
        "chinese": "n. An investigationThe FBI launched an inquiry into the relationship between organized crime and the trucking company.Parts of speech inquire v"
      },
      {
        "word": "intrusively [in'tru:sivli]",
        "chinese": "adv. In a way that brings an unwanted person or thing intosomeone else’s affairsThe new consultant from company headquarters appeared intrusively at meetings, staff parties, and other functions where hewas not wanted.Parts of speech intrude v,intrusion n,intruder n,intrusive adj"
      },
      {
        "word": "seize [si:z]",
        "chinese": "v. To take something against its owner’s willFederal agents can seize private homes and other property possiblyused in the production or sale of illegal drugs.Parts of speech seizure n"
      },
      {
        "word": "surveillance [sə:'veiləns]",
        "chinese": "n. A process of watching something or someone for along time, usually because the person is suspected of somethingPolice surveillance of one suspected car thief resulted in the arrestof a whole gang of carjackers.Usage tips Surveillance is often followed by an ofphrase."
      },
      {
        "word": "analyze ['ænəlaiz]",
        "chinese": "v. To examine something by looking at its partsChemists analyzed the white powder and found it to be only a mixture of sugar and salt.Parts of speech analysis n,analyst n"
      },
      {
        "word": "assail [ə'seil]",
        "chinese": "v. To attack or criticize forcefullyWith DNA evidence from the crime scene, the defense lawyer assailed the police for falsely arresting his client.Parts of speech assault n,assailant n"
      },
      {
        "word": "contrary ['kɔntrəri]",
        "chinese": "adj. OppositeContrary to most studies, Dr. Ito’s work shows the world’s climate isnot getting warmer.Usage tips Common phrases are contrary to and on the contrary."
      },
      {
        "word": "hypothesize[hai'pɔθisaiz]",
        "chinese": "v. To make a guess, the correctness of which will eventually be investigated systematically.Scientists hypothesize that planets capable of supporting life existbeyond our solar system, but they have not yet seen any.Usage tips Hypothesize is often followed by a thatclause.Parts of speech hypothesis n, hypothetical adj"
      },
      {
        "word": "impair [im'peə]",
        "chinese": "v. To make something less effective than usualThe snow impaired John’s ability to hear anyone’s footsteps.Usage tips The object of impair is often [someone’s] ability to.Parts of speech impairment n"
      },
      {
        "word": "inference ['infərəns]",
        "chinese": "n. A conclusion drawn from evidenceInspector Dowd’s inference that Ms. Miller was South African wasbased on her accent.Parts of speech infer v"
      },
      {
        "word": "objectively[əb'dʒektivli]",
        "chinese": "adv. Based on unbiased standards, not on personal opinionI don’t like Mr. Rowan, but looking objectively at his sales numbers,I saw that he was a very valuable employee.Parts of speech objective adj"
      },
      {
        "word": "suspicious [sə'spi∫əs]",
        "chinese": "adj. Believing that something is wrong; acting in a waythat makes people believe you have done something wrongThe neighbors became suspicious of Jim when he bought a big newcar and some fancy clothes.Jim’s suspicious purchases made his neighbors think he might begetting money illegally.Parts of speech suspicion n,suspiciously adv"
      },
      {
        "word": "tolerate ['tɔləreit]",
        "chinese": "v. To avoid getting upset about somethingMy math teacher tolerates a lot of talking in her class, but my history teacher tells us to be quiet.How can you tolerate that awful woman? Parts of speech toleration n,tolerance n,tolerant adj"
      },
      {
        "word": "versus ['və:səs]",
        "chinese": "prep. AgainstIn the debate, it was pro-war senators versus antiwar senators.Usage tips Versus is often abbreviated as vs.in sports contexts, orsimply v.in legal contexts."
      },
      {
        "word": "bribery['braibəri]",
        "chinese": "n. Giving money or other gifts to a government official or otherperson in authority in order to get special privilegesBribery of police officers is common in countries where policesalaries are very low.Parts of speech bribe v,bribe n"
      },
      {
        "word": "cynically ['sinikəli]",
        "chinese": "adv. Disrespectfully; emphasizing the weaknesses of otherwise respected thingsEmployees of the Roadways Department cynically referred to theirboss as “the banker” because he took so many bribes.Parts of speech cynic n,cynicism n,cynical adj"
      },
      {
        "word": "erode [i'roud]",
        "chinese": "v. To wear away and become smallerPeople’s respect for the government eroded as more officials werearrested for corruption.Usage tips Erode can be intransitive (the beach eroded) or transitive(the waves eroded the beach).Parts of speech erosion n,erosive adj"
      },
      {
        "word": "evade [i'veid]",
        "chinese": "v. To get away from something that tries to catch youThe robbery suspects tried to evade the police by fleeing to Canada.Parts of speech evasion n,evasive adj"
      },
      {
        "word": "grotesque [grou'tesk]",
        "chinese": "adj. Extremely unattractive, in a way that catches a lot of attention.Spending $3.5 million to redecorate the governor’s house is agrotesque misuse of public money."
      },
      {
        "word": "integrity [in'tegriti]",
        "chinese": "n. Personal honesty and good characterWe don’t have a problem with our employees stealing from thestore because we hire only people with a lot of integrity."
      },
      {
        "word": "prevalent['prevələnt]",
        "chinese": "adj. Common; easy to find because it exists in great amountsDistrust of elected officials was prevalent in our county becausemany of them were friends with certain candidates.Parts of speech prevail v,prevalence n"
      },
      {
        "word": "reform [ri'fɔ:m]",
        "chinese": "v. To make big improvementsThe new law was an attempt to reform the system of giving moneyto political candidates.Parts of speech reform n,reformer n"
      },
      {
        "word": "scandal ['skændl]",
        "chinese": "n. A case of wrongdoing that hurts someone’s reputationIn the Watergate scandal, some of the president’s top advisors wererevealed to be criminals.Parts of speech scandalize v,scandalous adj"
      },
      {
        "word": "unmask[ʌn'mɑ:sk]",
        "chinese": "v. Reveal; expose something that is hiddenThe Forge Trucking Company was eventually unmasked as a frontfor organized crime."
      },
      {
        "word": "abduction [æb'dʌk∫n]",
        "chinese": "n. KidnappingPirates got many crew members by abduction, snatching unluckycitizens from seaport towns.Parts of speech abduct v"
      },
      {
        "word": "coerce [kou'ə:s]",
        "chinese": "v. To force; to put pressure on someone to do somethingA criminal’s confession is not usable in court if the police coercehim or her into giving it.to coerce into obedience: ép phải vâng lờiParts of speech coercion n,coercive adj"
      },
      {
        "word": "detain[di'tein]",
        "chinese": "v. To prevent someone, for a relatively short time, from going on their wayThe police detained at least 20 men for questioning, but chargednone of them with a crime.Parts of speech detention n,detainee n"
      },
      {
        "word": "deviant['di:viənt]",
        "chinese": "adj. In a style that is not normal and is offensive to manyThe artist based his reputation on creating deviant works of art thatdisgusted most of the public.Usage tips Deviant always implies a bad opinion of someone orsomething.Parts of speech deviant n,deviation n,deviate v"
      },
      {
        "word": "distort[dis'tɔ:t]",
        "chinese": "v. To twist or misrepresent; to make something seem differentfrom what it really isIf you hold a pencil in a glass of water, the water distorts the appearance of the pencil.Parts of speech distortion n"
      },
      {
        "word": "intentionally [in'ten∫ənəli]",
        "chinese": "adv. On purpose, not by accidentDanny intentionally lost his last golf ball because he was tired of playing.Parts of speech intent n,intention n.intend v,intentional adj"
      },
      {
        "word": "piracy['paiərəsi]",
        "chinese": "n. Stealing a ship or taking the ship’s cargo; the unlawful copying of books, CDs, etc.Modern-day piracy occurs mostly near groups of small, uninhabitedislands where pirates can hide.The software company constantly battled piracy.Parts of speech pirate n,pirate v"
      },
      {
        "word": "predicament[pri'dikəmənt]",
        "chinese": "n. A difficult situation, one that is hard to get out ofCollege basketball stars face the predicament of wanting to graduate but being tempted by high professional salaries.to be in a predicament: ở trong tình trạng khó khănwhat a predicament! : thật là gay go!, thật là khó khăn"
      },
      {
        "word": "smuggle ['smʌgl]",
        "chinese": "v. To illegally bring things into a countryThe pirate Ben Dewar smuggled guns to British and Indian fightersin North America.Parts of speech smuggler n,smuggling n"
      }
    ]
  },
  "Lesson-7": {
    "theme": "TOEFL Vocabulary",
    "vocabulary": [
      {
        "word": "villainy ['viləni]",
        "chinese": "n. Exceptional badness, as demonstrated by many serious evil deedsimmoral or cruel behaviourFred was not a natural criminal, but he learned all kinds of villainywhile being jailed for a minor crime.immoral or cruel behaviourAt the end of the book, virtue is rewarded and villainy punished.Parts of speech villain n,villainous adj"
      },
      {
        "word": "addictive [ədɪktɪv]",
        "chinese": "adj. Making someone want it so much that the person feels ill without itSome drugs, like heroin or methamphetamines, are addictive to almost everyone who tries them.Parts of speech addict v,addict n,addiction n"
      },
      {
        "word": "cartel [kɑ:'tel]",
        "chinese": "n. A small group controlling a certain area of businessThe world’s major oil producers formed a cartel to control the priceand supply of petroleum."
      },
      {
        "word": "concentrated ['kɔnsentreitid]",
        "chinese": "adj. Strong because large amounts are in a certain spaceConcentrated lemon juice is very sour, so I mix it with water when Imake lemonade.a concentrated solution: một dung dịch cô đặcconcentrated food: thức ăn cô đặcParts of speech concentrate v,concentration n,concentrate n"
      },
      {
        "word": "interdict ['intədikt]",
        "chinese": "v. To keep something from reaching a certain placeWith faster patrol boats, the Coast Guard can more easily interdictdrugs being smuggled by sea.Parts of speech interdiction n"
      },
      {
        "word": "juxtapose ['dʒʌkstəpouz]",
        "chinese": "v. Place next to one anotherIf you juxtapose these two similar flowers, you can see clear differences between them.Parts of speech juxtaposition n"
      },
      {
        "word": "misconception['miskən'sep∫n]",
        "chinese": "n. A mistaken beliefA common misconception about rabbits is that they are a kind of rodent."
      },
      {
        "word": "modify['mɔdifai]",
        "chinese": "v. Make small changes in order to get a certain resultPeople who live in high mountains often modify their car engines torun well in the thinner air.Parts of speech modification n,modifier n"
      },
      {
        "word": "potent['poutənt]",
        "chinese": "adj. PowerfulA very potent type of marijuana with surprisingly strong effects became available in Burrytown.a potent charm: bùa phép có hiệu nghiệmpotent weapons: vũ khí sát thương mạnhpotent arguments: lý lẽ đầy sức thuyết phụcParts of speech potency n"
      },
      {
        "word": "residual [ri'zidjuəl]",
        "chinese": "adj. Left behind after most of a thing has goneIn the airplane, agents found residual traces of heroin.Usage tips Residual is often followed by trace, amount,or someother word referring to “quantity.”Parts of speech residue n"
      },
      {
        "word": "subtly ['sʌtli]",
        "chinese": "adv. In a quiet, hard-to-notice wayBy subtly changing the soft drink’s formula, we improved its tasteand made production cheaper.Parts of speech subtlety n,subtle adj"
      },
      {
        "word": "ancestral [æn'sestrəl]",
        "chinese": "adj. Relating to family members from earlier generationsSweden is my ancestral homeland, from which my great grandfather emigrated in 1922.Parts of speech ancestor n,ancestry n"
      },
      {
        "word": "cohesion [kou'hi:ʒn]",
        "chinese": "n. Ability to stay together as a unitFamily cohesion is difficult if young people have to go far away tofind work.Usage tips Cohesion can also be used to describe forces that keepmaterials or structures together.Parts of speech cohere v,cohesiveness n"
      },
      {
        "word": "descendant[di'sendənt]",
        "chinese": "n. A direct relative in a later generation (such as one’s son, daughter, or grandchild)Billy Sobieski claimed to be a descendant of Jan Sobieski, a formerking of Poland.Usage tips Descendant is often followed by an ofphrase.Parts of speech descend v,descent n"
      },
      {
        "word": "inheritance [in'heritəns]",
        "chinese": "n. Things passed down to you from your ancestorsMy inheritance from my grandmother included her favorite necklace.The title passes by inheritance to the eldest son: tước hiệu được chuyển theo quyền thừa kế cho người con trai cảInheritance of intelligence from one's father: sự thừa kế trí thông minh từ bố mìnhParts of speech inherit v,inheritor n"
      },
      {
        "word": "kin [kin]",
        "chinese": "n. RelativesEven though my uncle didn’t really like me, he was kind to me because we were kin.Usage tips A common phrase is next of kin, meaning “closestrelative.”Parts of speech kinship n"
      },
      {
        "word": "legitimate [li'dʒitimit]",
        "chinese": "adj. True and respectable; in the context of family, born ofa mother and father who were married to each otherYou can skip the meeting if you have a legitimate reason.Harcourt had two legitimate children with his wife Hannah and oneillegitimate son with a woman whom he met while traveling.Usage tips The opposite of legitimate is illegitimate.Parts of speech legitimize v,legitimacy n"
      },
      {
        "word": "paternal[pə'tə:nl]",
        "chinese": "adj. Relating to a fatherMy mother’s parents have both died, but my paternal grandparentsare still alive.Usage tips Paternal may appear with maternal, meaning “relating toa mother.”"
      },
      {
        "word": "proximity[prɔk'siməti]",
        "chinese": "n. NearnessThe house was comfortable, except for its proximity to a busy road.Usage tips Proximity can be followed by an ofphrase or a tophrase.Parts of speech proximate adj"
      },
      {
        "word": "sentiment ['sentimənt]",
        "chinese": "n. Feelings; opinion based on feelingsI share your sentiments about air travel, but I disagree that cars aresafer.Usage tips Sentiments(the plural) is more common than sentiment.Parts of speech sentimentality n,sentimental adj"
      },
      {
        "word": "sibling ['sibliη]",
        "chinese": "n. Brother or sisterMy sibling sand I got together to buy our parents a gift for their anniversary.I've two brothers and a sister : three siblings in all: tôi có hai anh trai và một em gái : ba anh chị em ruột cả thảyUsage tips Sibling is often preceded by a possessive noun or pronoun."
      },
      {
        "word": "affection [ə'fek∫n]",
        "chinese": "n. An emotional closeness or warmthI show affection for my girlfriend by spending time with her, not by spending money on her.He felt great affection for his sister: anh ta cảm thấy rất thương chị mìnhI tried to win her affection (s) : Tôi cố gắng chiếm cảm tình của cô ấyUsage tips Affection is often followed by a forphrase.Parts of speech affectionate adj"
      },
      {
        "word": "associate [ə'sou∫iit]",
        "chinese": "v. To regularly spend time togetherCarol doesn’t associate with people who smoke.Usage tips Associate is often followed by a withphrase.Parts of speech association n,associate n"
      },
      {
        "word": "bond[bɔnd]",
        "chinese": "n. A close connectionSome researchers say that there is an especially strong emotionalbond between twins.Usage tips A between phrase—indicating the things that areconnected—often follows bond.Parts of speech bond v"
      },
      {
        "word": "clique [kli:k]",
        "chinese": "n. A small group of friends who are unfriendly to people outside the groupHigh-schoolers form cliques to gain security and acceptance.Usage tips Clique indicates a negative feeling toward a group.Parts of speech cliquish adj"
      },
      {
        "word": "confide [kən'faid]",
        "chinese": "v. To tell very personal thingsTeenagers are more willing to confide in a friend than in a parent.Usage tips Confide is almost always followed by an inphrase.Parts of speech confidence n,confidant n,confidential adj"
      },
      {
        "word": "exclusive [iks'klu:siv]",
        "chinese": "adj. Keeping out all but a few peopleThe most exclusive universities accept only a small percentage ofpeople who want to attend.Usage tips Exclusivecan indicate a positive opinion, but in thecontext of friendship, it can mean “attached only to one person.”Parts of speech exclude v,exclusion n,exclusively adv"
      },
      {
        "word": "fluctuate ['flʌktjueit]",
        "chinese": "v. To change often, from one condition to anotherEarth’s climate fluctuates between warm periods and cold periods.Usage tips Fluctuate is usually followed by a betweenphrase (or by afrom...to structure).Parts of speech fluctuation n"
      },
      {
        "word": "in common ['kɔmən]",
        "chinese": "adv. As a shared characteristicBilly and Heather have a lot in common—basketball, a love ofpizza, and an interest in snakes.Usage tips In common very often appears with the verb to have."
      },
      {
        "word": "solidarity [,sɔli'dærəti]",
        "chinese": "n. Standing together despite pressure to move apartMany student groups declared solidarity with the Latino Student Association in their effort to get a Spanish-speaking principal.Usage tips Solidarity is usually used in political contexts."
      },
      {
        "word": "willing['wiliη]",
        "chinese": "adj. Agreeable and ready to do somethingBecause of their long friendship, Professor Gardner was willing tosay a few words at Jones’s birthday celebration.Usage tips Willing is almost always followed by a to+verb structure.Parts of speech will v,will n,willingness n"
      },
      {
        "word": "complex ['kɔmpleks]",
        "chinese": "adj. Not simple; involving many parts that work togetherA modern car engine is too complex for most car owners to repairby themselves.Parts of speech complexity n"
      },
      {
        "word": "despondent[di'spɔndənt]",
        "chinese": "adj. Extremely sad and without hope for the futureAfter his girlfriend left him, Johnson was despondent and wouldn’t talk to anyone."
      },
      {
        "word": "devotion[di'vou∫n]",
        "chinese": "n. A willingness to keep supporting someone you admireGrant showed great devotion to his wife, supporting her during herlong illness.Usage tips Devotion is often followed by a tophrase.Parts of speech devote v,devotee n"
      },
      {
        "word": "dilemma[di'ləmə]",
        "chinese": "n. A difficult choice between two thingsI was caught in a dilemma between traveling by airplane and takinga train, which is slower but more comfortable."
      },
      {
        "word": "engender [in'dʒendə]",
        "chinese": "v. To bring into being; to cause to existThe government’s warnings about terrorism engendered fearthroughout the nation.illiteracy often engenders crimesUsage tips Engender is often followed by a noun for an emotion."
      },
      {
        "word": "loyal ['lɔiəl]",
        "chinese": "adj. FaithfulCarter was loyal to his girlfriend and would not date anyone else.Usage tips Loyal is often followed by a tophrase.Parts of speech loyalty n,loyally adv"
      },
      {
        "word": "passion['pæ∫n]",
        "chinese": "n. An extremely strong emotion, like love or angerDebbie complained that there was no passion in her marriage.Parts of speech passionate adj,passionately adv"
      },
      {
        "word": "proliferation[prə,lifə'rei∫n]",
        "chinese": "n. An increase in the number of something and in thenumber of places it can be foundThe proliferation of fast-food restaurants has made it harder forAmericans to eat healthy lunches.Usage tips Proliferation is very often followed by an ofphrase.Parts of speech proliferate v"
      },
      {
        "word": "reciprocity [,resi'prɔsəti]",
        "chinese": "n. Doing as much for another as he or she has done for youDan was giving a lot of attention to Kelly, but he felt no reciprocityin their relationship.Parts of speech reciprocate v,reciprocal adj"
      },
      {
        "word": "vanish ['væni∫]",
        "chinese": "v. To disappear suddenlyWhen the sun came out, last night’s light snowfall vanished."
      },
      {
        "word": "antipathy [æn'tipəθi]",
        "chinese": "n. A strong, long-lasting negative feelingMy antipathy toward telemarketers is so strong that I am often rudeto them.Usage tips Antipathy is often followed by a towardphrase."
      },
      {
        "word": "arrogantly['ærəgəntli]",
        "chinese": "adv. In a way that shows a high opinion of oneself and a low opinion of othersJenny told us about her party only one day in advance, arrogantlythinking we had nothing else to do.Parts of speech arrogance n,arrogant adj"
      },
      {
        "word": "berate[bi'reit]",
        "chinese": "v. To say insulting and disrespectful thingsThe teacher lost his job because he cruelly berated students whomade mistakes.Usage tips You can only berate someone directly—only when he orshe can hear you."
      },
      {
        "word": "contemptuous [kən'temptjuəs]",
        "chinese": "adj. Having no respectMost scientists are contemptuous of reports that aliens from outerspace have landed on the Earth.Usage tips A very common structure is be contemptuous of.Parts of speech contempt n, contemptible adj, contemptuously adv"
      },
      {
        "word": "despise[dis'paiz]",
        "chinese": "v. Hate very muchTom grew to despise his greedy and unfriendly boss.to despise his hypocrisy, meanness, conceit: khinh miệt tính đạo đức giả, tính bủn xỉn, tính tự phụ của hắnstrike-breakers are often despised by their workmates:những kẻ phá đình công thường bị các bạn thợ khinh miệt"
      },
      {
        "word": "humiliation[hju:,mili'ei∫n]",
        "chinese": "n. An event that causes someone to feel that she or he haslost the respect of othersLosing the chess tournament was a great humiliation for Marie, andshe never played chess again.Parts of speech humiliate v"
      },
      {
        "word": "obnoxious[əb'nɔk∫əs]",
        "chinese": "adj. Bothersome; doing small things that others don’t likeMy obnoxious neighbor keeps talking to me while I’m trying toread in my backyard.Parts of speech obnoxiously adv"
      },
      {
        "word": "shame [∫eim]",
        "chinese": "n. Dishonor because one has done something wrongFeeling deep shame because of their son’s crimes, the Ford familymoved to a different town.Usage tips Shame is often followed by an of or aboutphrase.Parts of speech shame v,shameful adj,ashamed adj,shamefully adv"
      },
      {
        "word": "stigmatize ['stigmətaiz]",
        "chinese": "v. To mark with a visible feature that makes other peoplethink, perhaps incorrectly, that someone or something is wrongCadbury’s beard and tattoos stigmatized him as a bad match forWall Street, so he couldn’t find work as a financial analyst.Parts of speech stigma n"
      }
    ]
  },
  "Lesson-8": {
    "theme": "TOEFL Vocabulary",
    "vocabulary": [
      {
        "word": "vitriolic [,vitri'ɔlik]",
        "chinese": "adj. Showing an extreme, hateful angerThe mayor’s vitriolic attacks against the city council only made himsound unreasonable.Usage tips The origin of vitriolic is “vitriol,” a strong chemical thatcould cause painful burns."
      },
      {
        "word": "adolescent [,ædou'lesnt]",
        "chinese": "adj. Characteristic of a teenager; not fully grown upIn policy meetings, George refuses to reason with anyone and justscowls in an adolescent way.Parts of speech adolescent n,adolescence n"
      },
      {
        "word": "cause [kɔ:z]",
        "chinese": "n. A political or social goal that one believes is right and works to achieveOur river cleanup effort would be more effective if someone famousspoke out for the cause."
      },
      {
        "word": "conflict ['kɔnflikt]",
        "chinese": "v. To fit so poorly together that the differences cause a problemA teenager’s need for security can conflictwith his desire for independence from his family.Parts of speech conflict n"
      },
      {
        "word": "delinquency[di'liηkwənsi]",
        "chinese": "n. Serious misbehavior; not doing what one should doBecause of his laziness and delinquency, Lefty was an unreliablefriend.Usage tips A common combination is juvenile delinquency,meaning“criminal behavior by a teenager.”Parts of speech delinquent n,delinquent adj"
      },
      {
        "word": "fringe [frindʒ]",
        "chinese": "n. Edge; in social contexts, parts of society that look or act verydifferent from most peoplePunk music got its start at the fringe of London’s rock music culture.Usage tips Fringe implies an edge that is uneven and not very solid.Parts of speech fringy adj"
      },
      {
        "word": "hedonistic[,hi:də'nistik]",
        "chinese": "adj. Excessively interested in seeking pleasureSuddenly wealthy, Allen fell into a hedonistic life of parties, expensive dinners, and heavy drinking.Usage tips Hedonistic usually implies that the pleasures are wrong.Parts of speech hedonist n,hedonism n,hedonistically adv"
      },
      {
        "word": "hypocritically[,hipɔ'kritikəli]",
        "chinese": "adv. In a way that accuses other people of weaknessesthat the speaker also possessesHenry spent $2,500 on a new suit and then hypocritically accusedme of spending too much on clothes.He cares hypocritically for his father-in-law, in order to usurp all his fortune: hắn giả nhân giả nghĩa lo cho ông bố vợ hòng đoạt hết tài sản của ông taParts of speech hypocrite n,hypocrisy n,hypocritical adj"
      },
      {
        "word": "manipulation[mə,nipju'lei∫n]",
        "chinese": "n. Quietly moving or influencing people or things inorder to get what you wantBob’s manipulation of the boss’s feelings led to his promotion.Parts of speech manipulate v,manipulator n,manipulative adj"
      },
      {
        "word": "rebel [rɪ'bel]",
        "chinese": "v. To go against an established system or authorityThe people of Ghurdia rebelled against the dictator and set up anew government.Usage tips Rebel works well in political contexts and in contexts ofpersonal relationships.Parts of speech rebel n ['rebl] , rebellion n"
      },
      {
        "word": "status quo [,steitəs'kwou]",
        "chinese": "n. The systems and conditions that exist nowLet’s just maintain the status quo until we can think of a better way."
      },
      {
        "word": "abstract['æbstrækt]",
        "chinese": "adj. Not concrete and realistic; not obviously related to everyday experienceAbstract painting became popular partly because early photography was very realistic.Parts of speech abstraction n"
      },
      {
        "word": "context ['kɔntekst]",
        "chinese": "n. A larger environment that something fits intoIn the context of Soviet Russia, public art had to be about the triumph of communism and its leaders.Usage tips The preposition in often comes before context,and an ofphrase often comes after it.Parts of speech contextualize v,contextual adj"
      },
      {
        "word": "depict[di'pikt]",
        "chinese": "v. To show in picturesMichelangelo’s painting on the ceiling of the Sistine Chapel depictsnine scenes from the Bible.Parts of speech depiction n"
      },
      {
        "word": "dimension[di'men∫n]",
        "chinese": "n. A direction or surface along which something can bemeasured; an aspectThe three dimensions of physical objects are length, width, and depth.One dimension of the problem is their long history of competition.Parts of speech dimensional adj"
      },
      {
        "word": "esthetically [esθetɪkli]",
        "chinese": "adv. In a way that relates to beauty or appearanceThe outside of the office building is esthetically pleasing, but the inside is dark and unpleasant.Usage tips Esthetically is often spelled with an “a” at the beginning:aesthetically.Parts of speech esthetic n,esthete n,esthetic adj"
      },
      {
        "word": "intrinsic[in'trinsik]",
        "chinese": "adj. Being part of the basic nature of somethingFrequent elections are intrinsic to a democratic system.Parts of speech intrinsically adv"
      },
      {
        "word": "perspective[pə'spektiv]",
        "chinese": "n. A way of seeing from a particular location; a way ofthinking about somethingFrom my perspective,the entire town can be seen through a set oflarge windows.They held different perspective son how to care for their aging parents."
      },
      {
        "word": "portrayal[pɔt'reıəl]",
        "chinese": "n. A description or drawing that reflects a certain point of viewMost portrayals of Abraham Lincoln emphasize his sense of humorand his honesty.Usage tips Portrayal is often followed by an ofphrase to indicatewhat is being described.Parts of speech portray v"
      },
      {
        "word": "realism ['riəlizm]",
        "chinese": "n. A technique that tries to picture something as it really looksRealism was popular among seventeenth-century Flemish painterslike Rembrandt van Rijn.Parts of speech realist n,realistic adj"
      },
      {
        "word": "spectrum['spektrəm]",
        "chinese": "n. A range of different things, usually colorsBart’s colorful designs include every color of the spectrum,fromdeep blue to vibrant red.Usage tips The phrase the spectrum frequently means “the colorsthat the human eye can see.”"
      },
      {
        "word": "advent ['ædvənt]",
        "chinese": "n. Coming; arrivalThe advent of the automobile greatly increased the demand for petroleum.Usage tips Advent is usually followed by an ofphrase."
      },
      {
        "word": "ambiguous [æm'bigjuəs]",
        "chinese": "adj. Having more than one possible meaningThe sentence It’s hard to say is ambiguous,with different meaningsin different contexts.Parts of speech ambiguity n,ambiguously adv"
      },
      {
        "word": "connotation [,kɔnou'tei∫n]",
        "chinese": "n. A meaning implied, not stated directlyWhen my boss says,“Thank you,” the connotation is that she’s donetalking and I should leave.Parts of speech connote v"
      },
      {
        "word": "decipher[di'saifə]",
        "chinese": "v. To figure out the meaning, even though it is written in acode or an unknown languageThe Rosetta Stone helped archaeologists decipher ancient Egyptianwriting.Usage tips A cipher is a code or puzzle;deciphermeans “solve apuzzle written in code.”"
      },
      {
        "word": "denote[di'nout]",
        "chinese": "v. To mean something clearly and directlyAn “X” next to a name on this list denotes a person who has beenchosen for the soccer team.Parts of speech denotation n"
      },
      {
        "word": "illiterate [i'litərit]",
        "chinese": "adj. Unable to readIn many villages nearly everyone was illiterate and unschooled, andthe few who could read held great power.Parts of speech illiterate n, illiteracy n"
      },
      {
        "word": "ingenious[in'dʒi:njəs]",
        "chinese": "adj. Very clever and imaginativeAnn thought up an ingenious way to keep other people from accidentally taking her pens.Parts of speech ingenuity n,ingeniously adv"
      },
      {
        "word": "inscription [in'skrip∫n]",
        "chinese": "n. Something written into a piece of rock or metalThe inscription on my ring says “August 1,” because that was theday of our wedding.Parts of speech inscribe v"
      },
      {
        "word": "phonetic[fə'netik]",
        "chinese": "adj. Related to the sounds in a languageChildren learning to write often make up phonetic spellings, basedon the way a word sounds.Parts of speech phonetics n,phonetically adv"
      },
      {
        "word": "symbolic [sim'bɔlik]",
        "chinese": "adj. Acting as a sign for some other thing or ideaSince the 1970s, yellow ribbons have been symbolic of hope thatsomeone will return from a dangerous situation.Usage tips Symbolic is often followed by an ofphrase indicating themeaning of a symbol.Parts of speech symbolize v,symbol n,symbolically adv"
      },
      {
        "word": "amateurish ['æmətəri∫]",
        "chinese": "adj. Not good enough to be the work of professionalsWhoever painted this room did an amateurish job, with all sorts ofuneven edges.Parts of speech amateur n,amateurishly adv"
      },
      {
        "word": "cast [kɑ:st]",
        "chinese": "n. The group of actors in a play, movie, television show, etc.Some viewers mistakenly start thinking that a TV show’s cast members are really the characters they play.Usage tips In U.S. English, cast is singular. In some other varieties ofEnglish it is plural.Parts of speech cast v"
      },
      {
        "word": "charismatic [,kæriz'mætik]",
        "chinese": "adj. Extremely attractive and charmingBecause of the sparkle in his eye and his confident style, John F.Kennedy was a charismatic leader.Parts of speech charisma n,charismatically adv"
      },
      {
        "word": "gala ['gɑ:lə]",
        "chinese": "adj. Expensive, elaborately arranged, and full of celebrationA college graduation party should be a gala affair, not a backyardbarbecue.Usage tips Gala is somewhat old-fashioned, far more common inprint than in speech.Parts of speech gala n"
      },
      {
        "word": "hilarious[hi'leəriəs]",
        "chinese": "adj. Very funnyIn my opinion, the most hilarious character on television was Basil Fawlty.Parts of speech hilarity n"
      },
      {
        "word": "improvisation [,imprəvai'zei∫n]",
        "chinese": "n. Inventing a solution to an unexpected problemBoy Scouts take pride in their improvisation when faced with trouble during a camping trip.Parts of speech improvise v,improvisational adj"
      },
      {
        "word": "incompetent [in'kɔmpitənt]",
        "chinese": "adj. Unskilled; lacking the ability to perform a taskBecause we hired an incompetent builder to replace our roof, wenow have leaks everywhere.Usage tips Usually, incompetent implies that someone tries to dosomething but fails.Parts of speech incompetence n,incompetently adv"
      },
      {
        "word": "medium['mi:diəm]",
        "chinese": "n. A channel or way for a meaning to be expressedWatercolor art is often considered childish, but some artists haveachieved great things working in that medium.Usage tips The plural of medium is media."
      },
      {
        "word": "skit [skit]",
        "chinese": "n. A short, informal playMarnie and Chris spent a long time practicing their skit for the school show."
      },
      {
        "word": "zeal [zi:l]",
        "chinese": "n. Enthusiasm; a deep determination to do wellUnfortunately,Tom’s zeal to become a rock star distracted him fromhis studies.Usage tips Zeal is often followed by to plus a verb or by a forphrase.Parts of speech zealot n, zealous adj"
      },
      {
        "word": "bulk[bʌlk]",
        "chinese": "n. Largeness and a heavy appearanceThe bulk of Kevin’s athletic body was too great for one small chair, so he sat on a bench.He heaved his huge bulk out of the chair: hắn nhấc cái thân xác cồng kềnh của hắn ra khỏi ghếParts of speech bulky adj"
      },
      {
        "word": "capricious [kə'pri∫əs]",
        "chinese": "adj. Moving unpredictably from one thing to anotherYour college studies will go on too long if you make capriciousjumps from one major to another.Usage tips Capricious comes from a Latin word meaning “goat” andimplies a motion like the jumping of a goat.Parts of speech capriciousness n,capriciously adv"
      },
      {
        "word": "cumbersome ['kʌmbəsəm]",
        "chinese": "adj. Difficult to wear or carry because of weight or shapeTo make it to the top of the mountain before dark, the hikersdumped their cumbersome tent."
      },
      {
        "word": "exotic [eg'zɔtik]",
        "chinese": "adj. Interesting or unusual because of coming from a faraway placeI walked into the restaurant and smelled the exotic aromas of Malaysian spices.Parts of speech exoticism n,exotically adv"
      },
      {
        "word": "inhibit [in'hibit]",
        "chinese": "v. To discourage or to slow downThis lotion will inhibit the itching caused by mosquito bites.Parts of speech inhibition n"
      },
      {
        "word": "minimum['miniməm]",
        "chinese": "n. The smallest possible amount or levelThe minimum for being accepted to Cavill University is a score of 60 on the test.Parts of speech minimize v,minimum adj,minimal adj,minimally adv"
      },
      {
        "word": "striking ['straikiη]",
        "chinese": "adj. Very noticeable; easily attracting attentionGordon had a striking new attitude after he learned self-disciplineat the army academy.Usage tips Striking comes from a verb that means “to hit.”Parts of speech strike v,strikingly adv"
      },
      {
        "word": "trend [trend]",
        "chinese": "n. A movement in one direction or a widespread change in fashionThe trend among some young men is to wear their caps with the bill off to one side.Parts of speech trend v,trendy adj"
      },
      {
        "word": "vanity ['væniti]",
        "chinese": "n. An excessive concern for one’s appearanceMark’s vanity led him to spend far too much money on haircuts and new clothes.Parts of speech vain adj"
      }
    ]
  },
  "Lesson-9": {
    "theme": "TOEFL Vocabulary",
    "vocabulary": [
      {
        "word": "vulnerable ['vʌlnərəbl]",
        "chinese": "adj. Exposed to possible harmBabies and very old people are especially vulnerable to the new disease.Usage tips Vulnerable is often followed by a tophrase.Parts of speech vulnerability n,vulnerably adv"
      },
      {
        "word": "discriminatory",
        "chinese": "adj",
        "part_of_speech": "/dɪˈskrɪmɪnətɔːri/",
        "example": "unfair; treating somebody or one group of people worse than others"
      }
    ]
  }
}